[
    {
        "content": "<p>I'm wondering if anyone has good ideas to share about managing Google Maps API keys for clients. </p>\n<p>Do you ask clients to get their own keys?<br>\nDo you manage the keys in our own account?<br>\nDo you ask clients to set up the API account and provide a credit card and then login and configure it yourself?</p>\n<p>I get a headache everytime this comes up and there must be a better way to manage it.</p>",
        "id": 224985154,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612340103
    },
    {
        "content": "<p>I have most of my clients using my own account. There is never enough traffic to cost anything, but that doesn't seem the right solution either.</p>",
        "id": 224985712,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612340567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> same here...</p>",
        "id": 225007387,
        "sender_full_name": "mazze.ch",
        "timestamp": 1612354886
    },
    {
        "content": "<p>We usually walk them through creating their own account and then get them to add us to help manage</p>",
        "id": 225011099,
        "sender_full_name": "Herb",
        "timestamp": 1612357331
    },
    {
        "content": "<p>Also in the same boat. <span aria-label=\"neutral\" class=\"emoji emoji-1f610\" role=\"img\" title=\"neutral\">:neutral:</span>  I try to convince them of OpenStreetMap and if they insist on google, ask them to create the key with their own account. Using my account causes too much headache in times of GPDR.</p>",
        "id": 225013829,
        "sender_full_name": "indigoxela",
        "timestamp": 1612358636
    },
    {
        "content": "<p>Do they need a lookup or need multiple addresses? I got away from using gmaps for complex maps for this reason. If they just need a pin to their business location, I embed it. Otherwise, I've moved to open map services that don't require a bunch of hoops to jump through.</p>",
        "id": 225118044,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612413193
    }
]