[
    {
        "content": "<blockquote>\n<p>you dont think too many streams. i'm thinking that.</p>\n</blockquote>\n<p>I think that we should have as few streams as possible, buy I think that there are some good reasons for having some special streams. </p>\n<p>1) We have a stream for leadership and PMC, because these are small groups with limited membership. These streams do no effect most users. <br>\n2) We have a forum stream for automatic forum notifications, because some people have expressed a preference to not get these messages and the thought was that those who were interested could opt in instead of forcing everyone else to opt out. <br>\n3) We have a Community Chat stream, because I think that there should be a place that people feel comfortable chatting about off-topic things. I believe that many users will be uncomfortable bringing up \"off-topic\" subject in our main stream, especially new users who don't know the customs. For me, having a \"community chat\" stream gives people explicit permission to bring up other topics and connect as a community beyond the software. <br>\n4) We have a code review and contrib stream, I assume because it made sense to someone at some time. I would be happy to remove these channels and wrap that back into the main Backdrop CMS stream. However, I don't mind having them either. <br>\n5) Localization stream - makes sense on paper, but I don't know if it's required. I would leave that up to the localization team. <br>\n6) Virtual User Group stream - I think we could get rid of that.<br>\n7) Core notifications stream - I think that is there for those who are interested in automatic notifications about CORE. It's seems reasonable to keep this in it's own stream, once it's working. For now, that channel is not being used. <br>\n8) Dragonbot team - is there to test Dragonbot and chat about issues specific to Dragonbot. But, I'd be happy to get rid of that too. However, I suspect is a narrow group of people that are interested in the Dragonbot.</p>",
        "id": 192099275,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585360123
    },
    {
        "content": "<p>I think that most people are only going to care about the Backdrop and possibly Community Chat streams.</p>",
        "id": 192099298,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585360183
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256570\">StPaulTim</span> <a href=\"#narrow/stream/228714-Community-Chat/topic/Too.20many.20streams.3F/near/192099298\" title=\"#narrow/stream/228714-Community-Chat/topic/Too.20many.20streams.3F/near/192099298\">said</a>:</p>\n<blockquote>\n<p>I think that most people are only going to care about the Backdrop and possibly Community Chat streams.</p>\n</blockquote>\n<p>yep</p>",
        "id": 192099926,
        "sender_full_name": "docwilmot",
        "timestamp": 1585361098
    },
    {
        "content": "<p>and i think the community chat crosses over significantly. look at the topics there. that could all be in backdrop</p>",
        "id": 192099994,
        "sender_full_name": "docwilmot",
        "timestamp": 1585361193
    },
    {
        "content": "<p>but i get the need</p>",
        "id": 192100007,
        "sender_full_name": "docwilmot",
        "timestamp": 1585361255
    },
    {
        "content": "<p>To me, \"Community Chat\" does not imply off-topic chat, it implies chat about the Backdrop community. And then the \"Backdrop\" stream would seem to be about the product itself. I think re-naming \"Community Chat\" to something more like \"Off-topic Chat\" would make it more clear and then maybe the cross over would be reduced.</p>",
        "id": 192124593,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1585403948
    },
    {
        "content": "<p>If other people are seeing the same thing I am, I could understand the significant cross over in conversations due to that. I also thing that with use over time some of the cross over would be reduced as people got more familiar and comfortable with how everything is and works here.</p>",
        "id": 192124671,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1585404038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256627\">@oadaeh (Jason Flatt)</span> - You make a good point, that the title of this stream might not be conveying the intention. I think that the stream description does, but since the stream description is not really visible - that doesn't help much. </p>\n<p>Some groups have a very literal \"off-topic\" channel/stream. I thought that was a little too direct and wanted it to be softer, but maybe that's not working. I'd love to hear other ideas for the name of this stream.</p>",
        "id": 192137948,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585423527
    },
    {
        "content": "<p>Is \"Community Chat (other topics)\" any better?</p>",
        "id": 192138006,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585423635
    },
    {
        "content": "<p>Hmm, don't think so... What about 'General'? Or is that too, uh, general...?</p>",
        "id": 192138071,
        "sender_full_name": "BWPanda",
        "timestamp": 1585423685
    },
    {
        "content": "<blockquote>\n<p>Or is that too, uh, general...?</p>\n</blockquote>\n<p>I think it is, In this context I'm not sure what \"general\" means. </p>\n<p>Brainstorming: \"Non Backdrop,\" \"Real life,\" \"Being Human\" (Based on \"Being Human\" tracks at many events), \"Misc,\" \"Random\" (this is what Twin Cities Drupal uses in their Slack), other ideas...</p>",
        "id": 192138820,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585425075
    },
    {
        "content": "<p>Other. I also like Miscellaneous.</p>",
        "id": 192139191,
        "sender_full_name": "BWPanda",
        "timestamp": 1585425720
    },
    {
        "content": "<p>Water fountain? <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 192139238,
        "sender_full_name": "BWPanda",
        "timestamp": 1585425757
    },
    {
        "content": "<p>I'm used to \"Random\" from the channel Slack at work, but \"Misc\" is equally OK.</p>",
        "id": 192142634,
        "sender_full_name": "klonos",
        "timestamp": 1585431405
    },
    {
        "content": "<p>...now that the entire team in the agency I work for works from home, we've set up daily meetings called \"Watercooler Chats\".</p>",
        "id": 192142658,
        "sender_full_name": "klonos",
        "timestamp": 1585431464
    },
    {
        "content": "<p>Yeah my work has used Watercooler as well.</p>",
        "id": 192203971,
        "sender_full_name": "Herb",
        "timestamp": 1585532270
    }
]