[
    {
        "content": "<p>I have zero evidence or insight but I'm wondering if there'll be a move to delay the D7 EOL. Discuss</p>",
        "id": 192128477,
        "sender_full_name": "Herb",
        "timestamp": 1585409898
    },
    {
        "content": "<p>I think that the EOL deadline is far enough away that unless the effects of CoVid-19 are 8 or months long, it will not change the EOL. Also, the Drupal Association is currently hurting for money, and I think it's more likely that they will cut resources to D7 to save themselves in the hope that people will move to D8 sooner.</p>",
        "id": 192128764,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1585410273
    },
    {
        "content": "<p>My understanding is that the Drupal 7 and 8 are scheduled to reach EOL at the same time. I also understand that the Drupal 8 EOL is somewhat forced by the EOL of Symphony 3. </p>\n<p>If Symphony 3 reached EOL on schedule, forcing EOL for Drupal 8, it would seem unlikely (but not impossible) that they would continue to support Drupal 7 after Drupal 8 is no longer supported. However, now that I think about it, if the upgrade from Drupal 8 to Drupal 9 is as easy as they say, then maybe it doesn't matter?</p>",
        "id": 192137844,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585423348
    },
    {
        "content": "<p>I will certainly be MUCH easier for Drupal 8 sites to upgrade to Drupal 9 than it will be for Drupal 7 sites.</p>",
        "id": 192137869,
        "sender_full_name": "StPaulTim",
        "timestamp": 1585423398
    },
    {
        "content": "<p>Dropping support for D8 and leaving D7 on would be admitting that these are two different products. It will be the first time that a version is \"skipped\" so to say. ...it all depends on numbers I guess. If by Nov 2021 there's still a considerable amount of sites still in D7 (like 100s of thousands), then it would be idiotic to drop support just for the sake of \"sticking to the plan\".</p>",
        "id": 192142874,
        "sender_full_name": "klonos",
        "timestamp": 1585431754
    },
    {
        "content": "<p>...as <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> said, dropping support for D8 is being \"forced\" by the 3rd party software being used (Symfony mainly); whereas the reason for dropping D7 is just policy.</p>",
        "id": 192142946,
        "sender_full_name": "klonos",
        "timestamp": 1585431876
    }
]