[
    {
        "content": "<p>We've decided to use Eventbrite for selling tickets. I can create many different tickets and in my early promos, I've suggested that we are asking for a donation of $20 or €15. I like the idea of offering more than just dollars to reinforce the idea of an international event. However, I am guessing that it doesn't matter much to individuals from a practical standpoint - unless the price is significantly different. But, each different currency requires an additional ticket offering. </p>\n<p>Is there value (even symbolic) in offering multiple tickets in different currencies?<br>\nIf so, should I offer anything more than $ or € ?</p>",
        "id": 208042885,
        "sender_full_name": "StPaulTim",
        "timestamp": 1598403629
    },
    {
        "content": "<p>I can't speak for others, but when dealing with international stuff, I'm used to seeing prices in USD. Obviously I prefer AUD, but if it's too hard to set multiple currencies, then I'd say stick toUSD.</p>",
        "id": 208043001,
        "sender_full_name": "BWPanda",
        "timestamp": 1598403788
    },
    {
        "content": "<p>I'm with <span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> on this one ...it really doesn't matter; my bank does the conversion for me <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 208155975,
        "sender_full_name": "klonos",
        "timestamp": 1598480095
    },
    {
        "content": "<p>Yeah, I was thinking about it for mostly symbolic value. But, it's probably not worth it. It gets complicated.</p>",
        "id": 208156021,
        "sender_full_name": "StPaulTim",
        "timestamp": 1598480132
    },
    {
        "content": "<p>It always feels weird to say it's a global event but then assume everyone is paying in US dollars. But, I guess people are used to that.</p>",
        "id": 208156096,
        "sender_full_name": "StPaulTim",
        "timestamp": 1598480182
    },
    {
        "content": "<p>Yeah, the whole world revolves around the US it seems... <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 208156175,
        "sender_full_name": "BWPanda",
        "timestamp": 1598480260
    }
]