[
    {
        "content": "<p>We have various repositories on GitHub for Backdrop's infrastructure: <a href=\"http://b.org\">b.org</a>, API, forum, etc. I often browse the issue queues and try to work on things that are important or been there awhile, but then it's hard to get things reviewed and pushed live... Backdrop's main issue queue has a bunch of activity and contributors, but the infrastructure repos suffer from a lack of interest and/or visibility I feel. I'm wondering how to address this...</p>",
        "id": 212386868,
        "sender_full_name": "BWPanda",
        "timestamp": 1601962869
    },
    {
        "content": "<p>One thought I had was to assign maintainers to these repos. Contrib projects have a maintainer who's in charge of reviewing PRs, merging them, making releases, etc., and is generally the go-to person for that project. I'm wondering if something similar for the infrastructure repos would be beneficial...</p>",
        "id": 212386939,
        "sender_full_name": "BWPanda",
        "timestamp": 1601962970
    },
    {
        "content": "<p>Basically someone volunteers to maintain one of the repos. They're listed as such in the README and are the first person to go to for PR reviews, etc. Obviously they'll need to come under the leadership of the PMC, since all these repos are owned by, and represent, Backdrop CMS in general.</p>",
        "id": 212387107,
        "sender_full_name": "BWPanda",
        "timestamp": 1601963238
    },
    {
        "content": "<p>I don't know, just an idea I had. Thoughts?</p>",
        "id": 212387167,
        "sender_full_name": "BWPanda",
        "timestamp": 1601963283
    },
    {
        "content": "<p>It's true that there's less activity in those \"secondary\" queues. I think that we can start by asking certain issues to be brought up during our weekly meetings. ...I have been tasked to monitor <a href=\"https://github.com/backdrop-ops/contrib\">https://github.com/backdrop-ops/contrib</a> and I have to admit that I haven't been doing a really great job in the last months <span aria-label=\"sweat\" class=\"emoji emoji-1f613\" role=\"img\" title=\"sweat\">:sweat:</span></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/contrib\" style=\"background-image: url(https://avatars3.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/contrib\" title=\"backdrop-ops/contrib\">backdrop-ops/contrib</a></div><div class=\"message_embed_description\">Apply to join the contributed code developer team. - backdrop-ops/contrib</div></div></div>",
        "id": 212657004,
        "sender_full_name": "klonos",
        "timestamp": 1602143731
    }
]