[
    {
        "content": "<p>Just something to think about in regards to community:  Most people in the meetings and here on Zulip are 'Backdrop People\".  You work to forward the project, make it cooler, etc.  Thats obviously extremely essential and necessary.  But there are other people (like me, honestly) who make up most communities like this:  People who do this as a job but, frankly, probably wont contribute directly to the project without being hired (by a client) to do so.  That means we'll contribute ported modules and generally be supportive of the community, but don't really. have interest in getting directly involved in volunteering to make it what it is.  I might suggest that outreaching the people like that is important.  They grow the project because it's the best tool, not because they want to be involved in the community for the sake of itself.  I'm just sharing this because I feel a bit 'on the outside'  in this world because this is my work...not my enjoyment :)  I think devs like that are super important to communities, but I think they're often forgotten in outreach efforts.  All this just to say:  That's a group to remember and maybe think about forming some connection with.</p>",
        "id": 231317257,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616422759
    },
    {
        "content": "<p>I guess what I mean is outreach should probably be to 2 different groups:  \"Those who want to make our project better\" and \"Those who will make our project better because it's a tool they use daily\".  Anyone see where I'm coming from?  Or is that just me....? :)</p>",
        "id": 231317656,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616422900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> many thanks for this useful insight. I'm looking forward to what the \"outreach gang\" will reply. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>Looking at the (growing) memberlist of this chat here totally confirms your statement: most are here, because they think Backdrop is a good tool and provides what they need to get the job done.</p>\n<p>I'm convinced that people who got/get involved and play a more active role in the community get motivated by this majority of members. A good tool is worth working for.</p>\n<p>I'm writing that as someone, who definitely got involved more than I initially planned (and ever would have thought), but I'm no member of the \"inner circle\", too. For me Backdrop is a tool, just like for you, but the community definitely captured me (be warned, it's a trap <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span>).</p>",
        "id": 231327983,
        "sender_full_name": "indigoxela",
        "timestamp": 1616426352
    },
    {
        "content": "<p>Thanks for the input...although I think I'm safe :) I pretty much functioned this way for the past 15 years of Drupal as well!  Happy to contribute when and where I can, but I just don't have the passion to be part of another project...at least not now.  (side note: I hope my comments are seen as trying to be helpful, not putting my foot down as \"Im not here to help!\".  Just trying to bring some people's reality into the discussion)</p>",
        "id": 231328408,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616426482
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> I think that you underestimate your contributions TBH ...if you report issues in GitHub, then you <em>are</em> helping! ...if you help test the PRs others provide for the issues that are blockers for your projects, then  <em>are</em> helping! ...if you contribute modules you have ported, you <em>are</em> helping!</p>",
        "id": 231329161,
        "sender_full_name": "klonos",
        "timestamp": 1616426722
    },
    {
        "content": "<p>...all those things are contributions ...even you taking the time to chime in here, and post the comment that started this topic is also contributing <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 231329268,
        "sender_full_name": "klonos",
        "timestamp": 1616426759
    },
    {
        "content": "<p>Oh, I'm certainly not against helping!  I love it when I can!  I've just noticed that most of the discussions tend to be about 'getting involved' when, frankly, I think there's alot of people like me who are happy to contribute but dont really want to 'get involved'.  I think that group of people can be a resource to help the project, even if their 'care' is limited (if that makes any sense)</p>",
        "id": 231329497,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616426827
    },
    {
        "content": "<p>Indeed <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> ...on another note, if you ever got the energy/motivation to start podcasts again, but this time do it with Backdrop as a topic, then that would be an awesome contribution ...no pressure <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 231329675,
        "sender_full_name": "klonos",
        "timestamp": 1616426899
    },
    {
        "content": "<p>Yeah, I've absolutely thought about doing some videos about Backdrop and that's where my focus would be without a doubt.  I love teaching and helping when it fits in with life :)</p>",
        "id": 231329904,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616426991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> - I certainly agree about the distinction you make between two audiences. However, let me clarify to make sure I understand your original point. If I understand you correctly, it sounds as if you believe that our current outreach efforts are mostly targeted at the kind of user that is going to get involved and contribute to the project as opposed to the kind of developer is only interested in Backdrop CMS as a professional tool.</p>\n<p>You seem to be recommending that we put more effort in outreach towards the later group. The group that grows the community by using Backdrop, even if they don't actively contribute time/code to the project. </p>\n<p>Is that your point?</p>\n<p>NOTE: Your point  is interesting and valuable either way, I am only asking because I'm really not sure which group you think we should focus on more and which you think we are currently focused on - and I am very much interested in your insight (and making sure i understand it correctly).</p>",
        "id": 231355413,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616435619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> I think you've got it exactly right.  I guess what promped this was the fact that so much of the communication here and via youtube/zoom is focused on project direction, core features, etc etc.  As someone who probably won't be involved in any of that, I could imagine how it could be a barrier to someone newer..they may feel like they need to volunteer or aren't welcome.  I don't really have that feeling exactly because I was around D7 for so long...but I could sense that it could be an issue.</p>",
        "id": 231363414,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616438740
    },
    {
        "content": "<p>I guess my suggestion is to think about a way to outreach in a way thats 'product focused'...like \"here's what Backdrop can do for you\" rather than \"what can you do to help Backdrop?\".</p>",
        "id": 231363701,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616438873
    },
    {
        "content": "<p>and, sorry to spam..but one more thought:  I guess I notice that most of the talk is about the nuts/bolts/development of core/modules and not development of websites (or apps or whatever).  The focus is on 'inside baseball' rather than what you can do with the software.  NONE of that is 'bad' at all...just offering a way to reach more people (maybe...)</p>",
        "id": 231364183,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616439047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> - There you go again. Contributing to the project. :-)</p>\n<p>This is valuable feedback and very interesting. I believe that we understand the difference between these two audiences and that we try to do specific outreach to the audience that you are referring to. Developers as users, not necessarily contributors. </p>\n<p>I sometimes think that maybe we should do more outreach targeted at potential contributors. </p>\n<p>My take away from your comments is that if we mix our developers as users outreach with all our internal discussions, the messages gets muddled and developers as users might feel uncomfortable participating.</p>",
        "id": 231373487,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616442431
    },
    {
        "content": "<p>The forum, in my view, is the place where we most clearly reach out to developers as users (with very little discussion of contribution). In almost every other channel, these two things are mixed together. </p>\n<p>Maybe we should move our Backdrop for contributors discussions into another stream, example \"Backdrop Core\" and leave this stream for discussions about using and developing with Backdrop.</p>",
        "id": 231374001,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616442608
    },
    {
        "content": "<p>I think that in the past, we may have quietly assumed (without thinking about it) that Zulip would mostly be of interest to contributors and that while users are welcome, we didn't expect many of them. </p>\n<p>Maybe that was true in the past, but not anymore.</p>",
        "id": 231374160,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616442667
    },
    {
        "content": "<p>I'm also torn, because I would really prefer that all the user support questions happen in the forum, where they are archived and easier for new users to find. But, I know that lots of users would prefer to ask their questions here.</p>",
        "id": 231374397,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616442763
    },
    {
        "content": "<blockquote>\n<p>I sometimes think that maybe we should do more outreach targeted at potential contributors.</p>\n</blockquote>\n<p>I think that's the opposite of what <span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> is saying... He's saying we should do more outreach and acknowledgement of developers and users of Backdrop who might <em>never</em> contribute, and to let them feel that that's ok. Don't refer to them as 'potential' contributors, as that makes them feel like there's an expectation...</p>",
        "id": 231375011,
        "sender_full_name": "BWPanda",
        "timestamp": 1616443035
    },
    {
        "content": "<p>Yeah, honestly I'm not really suggesting you \"should\" do anything different than what you're doing.  Just pointing out the distinction I see and that it might be something to think about.  I only said something because I know there's probably lots of potential devs that feel like I do but might never say anything.  I've had enough time in the D7 community that I feel comfortable speaking up. :)</p>",
        "id": 231379985,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616445168
    },
    {
        "content": "<blockquote>\n<p>I think that's the opposite of what @Rob Feature is saying... He's saying we should do more outreach and acknowledgement of developers and users of Backdrop who might never contribute, and to let them feel that that's ok.</p>\n</blockquote>\n<p>Yes, I understood that after first asking for clarification. I was intentionally pointing out that my own perception is the opposite. I feel like we do lots of outreach to users that has nothing to do with contribution and I sometimes think we need to do the opposite. Yes, this is in contrast to Rob's suggestion, which I find interesting and useful.</p>",
        "id": 231390599,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616449985
    },
    {
        "content": "<p>I think the disconnect between what Rob is saying and my own perception of what we are doing is that all of our outreach to user/developers maybe getting mixed up with the communication that we do with contributors.</p>",
        "id": 231390901,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616450161
    },
    {
        "content": "<p>Currently, in my view we are doing outreach to the developer users through 1) The forum 2) The Virtual User Group. In my view, both of these channels are specifically set up to help users use backdrop, not contribute. In my view, we make this effort intentionally. We have discussed this same issue in regards to Backdrop Live. Is it for users or for contributors. I like for it to be for both, but we might not be making that clear.</p>",
        "id": 231391299,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616450361
    },
    {
        "content": "<blockquote>\n<p>because I know there's probably lots of potential devs that feel like I do but might never say anything. I've had enough time in the D7 community that I feel comfortable speaking up. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span>  I think that you are probably correct, which is why I really appreciate this feedback.</p>",
        "id": 231391569,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616450485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> - Does this make sense? Do you think it would be helpful?<br>\n<a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781\">https://github.com/backdrop-ops/backdropcms.org/issues/781</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781\" title=\"Create &quot;Support&quot; and &quot;Contribution&quot; streams in Zulip  · Issue #781 · backdrop-ops/backdropcms.org\">Create \"Support\" and \"Contribution\" streams in Zulip  · Issue #781 · backdrop-ops/backdropcms.org</a></div><div class=\"message_embed_description\">A user pointed out that many our streams of communication with the community include lots of &quot;contributor&quot; communication that might make &quot;users&quot; uncomfortable participating or a...</div></div></div>",
        "id": 231396215,
        "sender_full_name": "StPaulTim",
        "timestamp": 1616453231
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> I'll review and comment tomorrow, but I've got some thoughts which I'll share there.</p>",
        "id": 231398349,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616454407
    },
    {
        "content": "<p>Huh, there we go forcing you to contribute again <span aria-label=\"stuck out tongue closed eyes\" class=\"emoji emoji-1f61d\" role=\"img\" title=\"stuck out tongue closed eyes\">:stuck_out_tongue_closed_eyes:</span> ...defeats the purpose <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 231415209,
        "sender_full_name": "klonos",
        "timestamp": 1616467701
    },
    {
        "content": "<p>Ha, its cool...again, I'm happy to pitch in when I can.   Gave a stream of consciousness answer over on that issue...</p>",
        "id": 231461477,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616502732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> So, what do you think about our forum? <a href=\"https://forum.backdropcms.org/forum\">https://forum.backdropcms.org/forum</a> Do you consider it to be helpful?</p>",
        "id": 231465258,
        "sender_full_name": "indigoxela",
        "timestamp": 1616504416
    },
    {
        "content": "<p>Honestly, I had no idea there was a forum until I saw discussions about it here last week :)</p>",
        "id": 231465342,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504439
    },
    {
        "content": "<p>Here's the thing to remember though:  I'm not really the target audience of who I'm talking about.  I don't usually have 'how to' questions either because I know the answer from Drupal or because I haven't tried to build a 'thing that needs answers' yet.</p>",
        "id": 231465483,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504489
    },
    {
        "content": "<p>If I'm a noob and I go to <a href=\"http://backdropcms.org\">backdropcms.org</a> I woudl hope to see a big link on the page somewhere thats like \"New to Backdrop?  Get answers!\"...with a link to helpful stuff.</p>",
        "id": 231465817,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504590
    },
    {
        "content": "<p>Maybe a 3rd button next to \"Demo\" and \"Download\"...I donno.  I just know that if you're checking out Backdrop, one of the first big selling points is seeing that there's a friendly active community who is going to help you when you're stuck.</p>",
        "id": 231465987,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504657
    },
    {
        "content": "<p>Ooops... you had no idea? Then we might need to advertise the forum a little more. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n<p>The forum is - as far as I understand - supposed to be the low-level entry point. Github is often considered \"nerdish\" or too development-centric.</p>",
        "id": 231466530,
        "sender_full_name": "indigoxela",
        "timestamp": 1616504878
    },
    {
        "content": "<p><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781#issuecomment-804889011\">https://github.com/backdrop-ops/backdropcms.org/issues/781#issuecomment-804889011</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781#issuecomment-804889011\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/781#issuecomment-804889011\" title=\"Create &quot;Support&quot; and &quot;Contribution&quot; streams in Zulip  · Issue #781 · backdrop-ops/backdropcms.org\">Create \"Support\" and \"Contribution\" streams in Zulip  · Issue #781 · backdrop-ops/backdropcms.org</a></div><div class=\"message_embed_description\">A user pointed out that many our streams of communication with the community include lots of &quot;contributor&quot; communication that might make &quot;users&quot; uncomfortable participating or a...</div></div></div>",
        "id": 231466599,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504899
    },
    {
        "content": "<p>The friendliness and helpfulness of this community is a standout attribute, IMO.   Drupal failed at that too.  I think it should be front and center in a 'pitch' for potential users/developers.</p>",
        "id": 231466786,
        "sender_full_name": "Rob Feature",
        "timestamp": 1616504986
    },
    {
        "content": "<p>Yeah the \"support\" link at the top of <a href=\"http://b.org\">b.org</a> is too ambiguous which is where all of this info can be found.</p>",
        "id": 231701198,
        "sender_full_name": "Phil Ward",
        "timestamp": 1616616876
    }
]