[
    {
        "content": "<p>We had 38 people register for the Backdrop LIVE event, and we managed to raise $500US (not precise amount - if anyone has the exact info, please share it).  ...the event is totally free for all, with donations being optional, but I noticed the following: most people were from the US, but we also had participants from: Austria, Latvia, Dhaka/Bangladesh, Spain, Greece, Canada, Argentina, Italy, Germany, UK, Switzerland, the Cayman Islands, China, and 2 people from Australia (Melbourne/Sydney)<br>\nI personally would be willing to donate a considerable amount of money at the end of the financial year (which is June 30 in Australia), but only if the donation amount would be tax-deductible ...I can't help but to think that more people like myself would want to do the same, but <a href=\"https://sfconservancy.org\">https://sfconservancy.org</a> operates only in the US though, so this cannot happen at the moment. We need to have the SFC look into that. ...if we managed to do that, I'd be willing to donate each year, some time before June 30.</p>",
        "id": 230213597,
        "sender_full_name": "klonos",
        "timestamp": 1615698475
    },
    {
        "content": "<p>I suspect the topic has come up before, but how about paetron or another monthly sub system? I am slowly starting to use backdrop for some of my work. I would be happy to donate a monthly amount back to core work esp. While patreon may not bring in a ground breaking amount, it would be an easy way to give back over time.</p>",
        "id": 230237457,
        "sender_full_name": "Eric Vander Wal",
        "timestamp": 1615727382
    },
    {
        "content": "<p>If we get CiviCRM set up (and a compatible payment processor) we could set up a donation page with a recurring option without additional platform overhead (like Patreon's fee on top of the payment processor fee).</p>",
        "id": 230238283,
        "sender_full_name": "Laryn",
        "timestamp": 1615728344
    },
    {
        "content": "<p>That too, but what I'm specifically trying to solve in my case is to figure out a way to donate a tax-deductible amount from a non-US country, to a US-based charity/non-profit (with the end goal being to be able to donate more).</p>",
        "id": 230245987,
        "sender_full_name": "klonos",
        "timestamp": 1615736465
    },
    {
        "content": "<p>...at the moment, any donation from any person in Australia (cannot speak for other countries) is not tax-deductible unless the charity/non-profit is Aussie.</p>",
        "id": 230246070,
        "sender_full_name": "klonos",
        "timestamp": 1615736533
    },
    {
        "content": "<p>Ditto for UK</p>",
        "id": 230319163,
        "sender_full_name": "yorkshirepudding",
        "timestamp": 1615802536
    }
]