[
    {
        "content": "<p>Can someone please explain something for me, I'm a bit confused...</p>\n<p>I'm migrating content from a D7 site (via a CSV file, and Feeds in Backdrop). I have copied over the entire <code>files</code> dir so Backdrop has all the same files as D7, and in a <code>presave</code> function I convert any absolute URLs to the old site to relative URLs for the new site in the Body field (so any embedded images are referencing the new site's files). After import, everything works fine, but there are a bunch of 'Temporary' files listed in <code>/admin/content/files</code>. After 6 hours and a cron run, they were removed from here, so I figured I needed to write code to make these files Permanent on import. However when I go to look for content that had an embedded image in the Body field, it's still there. And the file's are all still in the <code>files</code> directory. So it seems I don't have to do anything after all...?</p>\n<p>Therefore my question is: what's the purpose/reason for the files listed on <code>/admin/content/files</code>? Do I need to worry about them? Can I import files from D7 but have everything still work even after they're removed from that page? What's up with all this?</p>",
        "id": 205305531,
        "sender_full_name": "BWPanda",
        "timestamp": 1595981331
    },
    {
        "content": "<p>The /admin/content/files page lists all files that are in the file_manage table. If your content is referencing files and they are showing up in the content, but they are not displayed in /admin/content/files, then Backdrop is not managing the files.</p>",
        "id": 205306160,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1595982037
    },
    {
        "content": "<p>So follow-up question then becomes: what are 'managed' files? What's their benefit over regular (unmanaged?) files? What are the consequences of Backdrop not managing a file?</p>",
        "id": 205306659,
        "sender_full_name": "BWPanda",
        "timestamp": 1595982612
    },
    {
        "content": "<p>Having a file managed by Backdrop means that the file can be available to be (re-)used (like in the media browser) or seen (like at /admin/content/file) everywhere that capability is available on the site. It also means that some person does not need to manually copy or remove files on the server -- it is handled by management facility.</p>",
        "id": 205357275,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1596030047
    },
    {
        "content": "<p>Ok, so in the end, migrating files from D7 and having them deleted from the Manage Files page isn't an issue, they'll keep working regardless...?</p>",
        "id": 205974787,
        "sender_full_name": "BWPanda",
        "timestamp": 1596585117
    },
    {
        "content": "<p>Only if the files aren't deleted as a part of removing them from the database, which is one of the things that happens with the file management processes. If the links in the content are to files that Backdrop is not managing, then they should continue to stick around and work.<br>\nHowever, I would have thought that doing your migration the way you did would have put the files into the Backdrop file management system. So I think I would need to know more about and examine the process, the data, and the code to understand why it worked the way it did. There might be an obvious explanation that I'm missing or not thinking of.</p>",
        "id": 205979591,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1596590882
    },
    {
        "content": "<p>I'm using Views Data Export in D7 to make a CSV file which has file/image URLs. That's then imported into Backdrop using Feeds, and I have custom code that saves each URL to a File field.</p>",
        "id": 205979992,
        "sender_full_name": "BWPanda",
        "timestamp": 1596591563
    },
    {
        "content": "<p>That might be why they aren't being added to the file management process.</p>",
        "id": 205980554,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1596592269
    }
]