[
    {
        "content": "<p>In the past, it would sometimes take me 10 minutes just to find some of the git repos/issue queues that I knew existed, but couldn't remember where they were.</p>",
        "id": 217453077,
        "sender_full_name": "StPaulTim",
        "timestamp": 1605903058
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 217455445,
        "sender_full_name": "Phil Ward",
        "timestamp": 1605904398
    },
    {
        "content": "<p>When I get some time, I'll put together a more formal document that outlines this discussion a bit.</p>\n<p>Be forewarned, it will be lengthy.</p>",
        "id": 217482636,
        "sender_full_name": "Phil Ward",
        "timestamp": 1605930054
    },
    {
        "content": "<p>In <a href=\"https://backdropcms.org/resources/backdrop-cms-github\">https://backdropcms.org/resources/backdrop-cms-github</a> the <a href=\"http://backdropcms.org\">backdropcms.org</a> section mentions:</p>\n<blockquote>\n<p>We are also currently using this space for issues about marketing and outreach for BackdropCMS.</p>\n</blockquote>",
        "id": 217532932,
        "sender_full_name": "klonos",
        "timestamp": 1606017576
    },
    {
        "content": "<blockquote>\n<p>using this space for issues about marketing and outreach for BackdropCMS</p>\n</blockquote>\n<p>Sorry, I wasn't aware of that. It seems a little too late to move the discussion over to backdrop-ops (22 comments) <span aria-label=\"disappointed\" class=\"emoji emoji-1f61e\" role=\"img\" title=\"disappointed\">:disappointed:</span></p>",
        "id": 217542487,
        "sender_full_name": "indigoxela",
        "timestamp": 1606036411
    },
    {
        "content": "<p>No worries <span class=\"user-mention\" data-user-id=\"256738\">@indigoxela</span> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 217544757,
        "sender_full_name": "klonos",
        "timestamp": 1606040567
    },
    {
        "content": "<p>Maybe if/when we decide of an actionable way forward, we can create a specific issue/PR in the appropriate queue...</p>",
        "id": 217545117,
        "sender_full_name": "BWPanda",
        "timestamp": 1606041166
    },
    {
        "content": "<p>I believe the resource of Backdrop itself should be free. Open source is the future. Those with development skills should have no trouble making money through services / website development for those who won't or can't do it for themselves (most of the world). Figure into your pricing a 5% donation to support the platform that you're using to make money. Use that money to support better documentation of your projects or you could figure documentation costs/time into your pricing and charge the customer for the documentation they will need in the future.</p>\n<p>Essentially, that 5% you will use to pay yourself for ongoing support of the developments you needed for your customers that were not yet available as a Backdrop resource (theme or module, etc.) Or you could use that 5% you set aside to pay another developer to maintain your contribution. We should just have the attitude to give back. In my case, I have much more time than money, so I donate my time to move many of my interests forward.</p>\n<p>Consider creating a marketplace for website development services within the Backdrop ecosystem so that people who need help can find those developers who want to offer free services to non-profits/needy projects or offer real-world pricing to companies that are funded to pay for such services. Everybody wins.</p>",
        "id": 217567471,
        "sender_full_name": "Sarvasri",
        "timestamp": 1606075633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"333206\">@Sarvasri</span> I think a lot of folks feel the way you do about having time, but not money.</p>\n<p>However, I would like to point out that there are also a lot of people (businesses/organizations) that have money, but don't have time or knowledge.</p>\n<p>For this reason, I am advocating for a way to allow those who want to provide financial assistance for core, contribs or even custom, the ability to give back.</p>\n<p>If the only way a person, organization or business can give back is through financial assistance, but there is no way for them to do so, they don't end up giving back at all. This hurts the community.</p>\n<p>Let's take Ubercart as an example because that's what I use. I would gladly pay for additional features or support on that module because it benefits me. However, I wouldn't necessarily give back to core because that's not where my problem is. I'm left with hiring a third party developer to fix my problem and never give that back to the community because a) the maintainer doesn't want to mess with adding the fixes or b) I don't have time to add it as a contrib and then try to maintain it.</p>\n<p>I strongly believe it hurts the community more than it helps and have observed this over the last 13+ years with Drupal.</p>",
        "id": 217572666,
        "sender_full_name": "Phil Ward",
        "timestamp": 1606082781
    },
    {
        "content": "<p>Just so we're clear, I'm not advocating for a subscription model, or commercial model (though yes, I have suggested those options and they are widely not popular for good reason).</p>\n<p>The option I think a lot of folks can get on board with is a \"donation\" model where the ability to give back is available, but completely optional.</p>\n<p>There are a LOT of things to work out, but I think it is the most forgiving to keeping the entire platform and codebase free, but still opening an avenue for a lot of the community to give back who would otherwise never give back.</p>",
        "id": 217572989,
        "sender_full_name": "Phil Ward",
        "timestamp": 1606083259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> Have you looked into GitHub Sponsors? <a href=\"https://github.com/sponsors\">https://github.com/sponsors</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/sponsors\" style=\"background-image: url(https://github.githubassets.com/images/modules/site/social-cards/sponsors.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/sponsors\" title=\"GitHub Sponsors\">GitHub Sponsors</a></div><div class=\"message_embed_description\">Financially support the people behind your favorite open source projects with GitHub Sponsors.</div></div></div>",
        "id": 217573010,
        "sender_full_name": "BWPanda",
        "timestamp": 1606083316
    },
    {
        "content": "<p>THat sounds like something you might be interested in.</p>",
        "id": 217573013,
        "sender_full_name": "BWPanda",
        "timestamp": 1606083329
    },
    {
        "content": "<p>Though from what I've read, it seems that either Backdrop or individual contrib maintainers would need to register as a developer/organisaion in order for you to sponsor them...</p>",
        "id": 217573079,
        "sender_full_name": "BWPanda",
        "timestamp": 1606083398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> hum... That only takes care of part of the problem... For example, what if someone does a lot of work on documentation and someone in the community wants to say thanks by throwing them some beer money because the steps saved them hours of figuring it out from scratch?</p>\n<p>Loose example.</p>\n<p>If this whole monetization thing moves forward, Backdrop needs to set the standards of what it will look like and what is expected. For example, don't come here thinking you're going to make money because that's not how it works. You come here because you want to be passionate about the project. Any funds you receive are a \"thank you\" from the community and gives you a reason to focus back on that project because others are also passionate about your work and want to see it continue to move forward.</p>\n<p>Drupal did a great job of creating a friendly, helpful community. Backdrop is doing the same. It's the expectations of the community that molded it, and adding a monetization scheme would be no different. We just have to mold the expectation which is a lot easier when the community is small. The larger it becomes, the more difficult it is to set the expectation.</p>",
        "id": 217573458,
        "sender_full_name": "Phil Ward",
        "timestamp": 1606083946
    },
    {
        "content": "<p>As food for thought on this topic, I note that the CiviCRM module (on Backdrop and other platforms) provides the download for free, but also <a href=\"https://civicrm.org/support-us\">asks for financial support</a> in what seems like a pretty reasonable way. From our experience, when we started years ago, being able to use it for free was a very nice incentive to try it out, and then after a few years of using it, we decided it was time to support them annually by becoming a member. So it seems like providing a way to say \"thank you, here's money\" without making it feel negative if people don't contribute, would be a good thing.</p>",
        "id": 217573631,
        "sender_full_name": "bugfolder",
        "timestamp": 1606084151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335929\">@bugfolder</span> good points about CiviCRM</p>",
        "id": 217583876,
        "sender_full_name": "Herb",
        "timestamp": 1606099312
    },
    {
        "content": "<p>Does anyone know how well the membership thing actually works for CiviCRM?</p>",
        "id": 217594707,
        "sender_full_name": "indigoxela",
        "timestamp": 1606115499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256738\">@indigoxela</span> do you mean how many clients are paying for extended security releases? Or some other membership?</p>",
        "id": 217624626,
        "sender_full_name": "Herb",
        "timestamp": 1606136480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256705\">@Herb</span> that people pay for actual services isn't that relevant for us, I guess. More interesting is the \"membership\" thing - when there's no direct benefit.</p>",
        "id": 217625928,
        "sender_full_name": "indigoxela",
        "timestamp": 1606137270
    },
    {
        "content": "<p>My main input on this is that I want to make sure it's clear that payment isn't required and that everything is very invitational. (And even if an ask for a donation appears near the download button, an invitation to participate/join in other ways should be equally weighted).</p>",
        "id": 217820928,
        "sender_full_name": "Laryn",
        "timestamp": 1606256039
    },
    {
        "content": "<p>I agree on all points you made there <span class=\"user-mention\" data-user-id=\"256573\">@Laryn</span> <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 217829587,
        "sender_full_name": "klonos",
        "timestamp": 1606262110
    },
    {
        "content": "<p>I think those points are something we can all agree to.</p>\n<p>I strongly believe that these points can help steer the expectation of how monetization should look.</p>",
        "id": 217872556,
        "sender_full_name": "Phil Ward",
        "timestamp": 1606303539
    },
    {
        "content": "<p>Good read: <a href=\"https://stackoverflow.blog/2021/01/07/open-source-has-a-funding-problem/\">https://stackoverflow.blog/2021/01/07/open-source-has-a-funding-problem/</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://stackoverflow.blog/2021/01/07/open-source-has-a-funding-problem/\" style=\"background-image: url(https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/01/blog-open-source-funding-maze.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://stackoverflow.blog/2021/01/07/open-source-has-a-funding-problem/\" title=\"Open source has a funding problem - Stack Overflow Blog\">Open source has a funding problem - Stack Overflow Blog</a></div><div class=\"message_embed_description\">Relying on volunteers to maintain every open source project isn't long term sustainable. Funding open source projects could keep development moving, but would that funding be raised and who would pay for it?</div></div></div>",
        "id": 222210747,
        "sender_full_name": "Phil Ward",
        "timestamp": 1610264061
    },
    {
        "content": "<blockquote>\n<p>For me, there’s only one con of contributing: it’s a lot of work and responsibility without being income generating and my unpaid contributions are not sustainable economically.</p>\n</blockquote>\n<p>And another one bites the dust because of the \"free\" nature of Drupal. If Backdrop wants to keep good talent, it must figure out a way to make the platform generate a different kind of motivation for people who don't need yet another hobby.</p>\n<p><a href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-career\">https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-career</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-career\" style=\"background-image: url(https://user-images.strikinglycdn.com/res/hrscywv4p/image/upload/c_limit,fl_lossy,h_9000,w_1200,f_auto,q_auto/1121090/445330_81546.jpeg)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-career\" title=\"To Drupal or not to Drupal… that is my mid-career crisis\">To Drupal or not to Drupal… that is my mid-career crisis</a></div><div class=\"message_embed_description\">Two months with a new puppy As the year came to an end, I shared a blog post title, Ozzy, the puppy, vs. Drupal, the open-source project. This blog post began a discussion about th</div></div></div>",
        "id": 225629279,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612830055
    },
    {
        "content": "<p>Jacob certainly has made multiple efforts to have his work on Drupal be sustainable economically, frequently with negative backlash from the community.</p>",
        "id": 225631551,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1612831887
    },
    {
        "content": "<p>I think the Drupal community has moved to the point that only enterprises are allowed to profit from it, and individuals should have a job with an enterprise if they want to be paid for their efforts.</p>",
        "id": 225631664,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1612831958
    },
    {
        "content": "<p>Unfortunately, Backdrop has the same mentally: \"You should work a job that pays you to use and build Backdrop\". It's just on a smaller scale with a different group of clients.</p>",
        "id": 225632504,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612832544
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> I don't think there's been one approach by the Backdrop community. I tend to lean towards finding ways to support the work. I just don't know yet what's the best approach</p>",
        "id": 225640810,
        "sender_full_name": "Herb",
        "timestamp": 1612840174
    },
    {
        "content": "<p>I think it might be helpful if this topic were \"Financially supporting core development\" rather than \"Monetizing Backdrop.\" While I don't think it was the intention, \"Monetizing Backdrop\" sounds like a discussion about how to best profit off Backdrop (not that this is entirely bad). </p>\n<p>I believe that the problem that we'd like to address is how to best support and reward work on core, contrib, and community development. This may or may not involve monetizing Backdrop. But, I think that monetizing Backdrop is not the right place to start.</p>",
        "id": 225645399,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612845404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> I was intentionally trying to be as general and generic as possible. \"Monetizing Backdrop\" seemed to be a good phrase for it. If you have a better phrase to encompass the generalization, feel free to rename the topic.</p>",
        "id": 225646134,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612846483
    },
    {
        "content": "<p>How about just \"Funding Backdrop\"</p>",
        "id": 225646589,
        "sender_full_name": "Herb",
        "timestamp": 1612847098
    },
    {
        "content": "<p>I'd love to have this discussion during our next Backdrop Live.</p>",
        "id": 225646675,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612847188
    },
    {
        "content": "<p>That would be a good place for it for sure.</p>\n<p>\"Funding Backdrop\" isn't a bad name. Sounds a bit less cold than monetizing</p>",
        "id": 225651900,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612854229
    },
    {
        "content": "<p>Maybe interesting in this context is the <a href=\"https://www.linuxfoundation.org/en/resources/publications/2020-foss-contributor-survey/\">2020 FOSS Contributor Survey</a> - especially the part about \"Motivations: What are their reasons for starting, continuing, or stopping contributions to FOSS?\" The top three and bottom three reasons might come as a surprise to some of you.</p>\n<p>FTR - I share the <em>top three reasons to contribute</em>. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> </p>\n<p><span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> linked that some time ago in the Community Chat stream.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.linuxfoundation.org/en/resources/publications/2020-foss-contributor-survey/\" style=\"background-image: url(https://www.linuxfoundation.org/wp-content/uploads/feat-pub-foss-contrib-surv20.jpg)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.linuxfoundation.org/en/resources/publications/2020-foss-contributor-survey/\" title=\"2020 FOSS Contributor Survey - Linux Foundation\">2020 FOSS Contributor Survey - Linux Foundation</a></div><div class=\"message_embed_description\">Free and Open Source Software (FOSS) has become a critical part of the modern economy. It has been estimated that FOSS constitutes 80-90% of any given piece of modern software, and software is an increasingly vital resource in nearly all industries. This heavy reliance on FOSS is common in both the public and private sectors, in both tech and non-tech organizations. Therefore, ensuring the health and security of FOSS is critical to the future of nearly all industries in the modern economy.</div></div></div>",
        "id": 225652041,
        "sender_full_name": "indigoxela",
        "timestamp": 1612854388
    },
    {
        "content": "<p>Maybe this should be an initiative or a META or something else that allows these thoughts and ideas to be proposed and recorded and discussed more systematically. I have no idea where this is now.</p>",
        "id": 225688701,
        "sender_full_name": "docwilmot",
        "timestamp": 1612877268
    },
    {
        "content": "<p>p.s. I strongly suspect I would be in support of monetization, whatever that means, after we decide what it means.</p>",
        "id": 225688807,
        "sender_full_name": "docwilmot",
        "timestamp": 1612877315
    },
    {
        "content": "<p>I have to wonder what the results of that survey would look like if the demographics weren't heavily skewed towards \"paid professionals\".</p>",
        "id": 225739923,
        "sender_full_name": "Phil Ward",
        "timestamp": 1612897293
    },
    {
        "content": "<p>Still waiting on a response from the author, but here is an interesting comment:</p>\n<blockquote>\n<p>Michael von Zweigbergk Id love for a dev tipjar or even a buy module at <a href=\"http://Drupal.org\">Drupal.org</a>. it makes 100% sense for me and my company. And webform would have been bought/tipped many times as it saves my bacon each project.</p>\n</blockquote>",
        "id": 225963138,
        "sender_full_name": "Phil Ward",
        "timestamp": 1613034082
    },
    {
        "content": "<p>Tip jars are nice and well, so long as they don't become a honey jars (which unfortunately seems to be what eventually happens most of the times when money is evolved) ...meaning that contributors start getting used to being paid for their work, to the point that they become demotivated unless tips are coming in <span aria-label=\"disappointed\" class=\"emoji emoji-1f61e\" role=\"img\" title=\"disappointed\">:disappointed:</span> ...also, are we going to \"back-tip\" all the effort/energy that all the wonderful people of our community have been contributing all these past 5-6years? ...and if so, then how do we go about measuring that fairly? ...what about Drupal contributors, upon whom our work is based on? ...there's many things to discuss/consider, and I find it a dangerously \"gray\" area. I simply fear that in our efforts to find more contributors, we may be potentially causing existing contributors to stop donating their time <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span> ...personally, all it'd take would be one decision towards something that I find even remotely \"fishy\" according to my ethos, and I'd have to step down from the PMC and move away from the community, despite my (otherwise) unconditional love for it.</p>",
        "id": 226269430,
        "sender_full_name": "klonos",
        "timestamp": 1613252766
    },
    {
        "content": "<p>You could add to your list of things to consider the FOSS software required to make Backdrop work, like PHP, etc.</p>",
        "id": 226273848,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1613257356
    },
    {
        "content": "<p>Just to add something to the discussion. I was looking for something on an unrelated matter and found <a href=\"https://issuehunt.io\">https://issuehunt.io</a> . It links with GitHub and allows people to contribute towards bounties for fixing issues on open source software. I can see this has potential, but could also cause problems.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://issuehunt.io\" style=\"background-image: url(https://issuehunt.io/static/ogp.jpg)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://issuehunt.io\" title=\"IssueHunt - A bounty platform for open source projects\">IssueHunt - A bounty platform for open source projects</a></div><div class=\"message_embed_description\">IssueHunt 🦉 =  OSS Development ⚒ + Bounty Program 💰.\n      IssueHunt is an issue-based bounty platform for open source projects.\n      Anyone can put a bounty on not only a bug but also on OSS feature requests listed on IssueHunt. Collected funds will be distributed to project owners and contributors.</div></div></div>",
        "id": 226638625,
        "sender_full_name": "yorkshirepudding",
        "timestamp": 1613558230
    },
    {
        "content": "<p>Part 2<br>\n<a href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-plan\">https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-plan</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-plan\" style=\"background-image: url(https://user-images.strikinglycdn.com/res/hrscywv4p/image/upload/c_limit,fl_lossy,h_9000,w_1200,f_auto,q_auto,x_802.8387096774193,y_436.45032258064515/1121090/605166_418515.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.jrockowitz.com/blog/to-drupal-or-not-to-drupal-plan\" title=\"To Drupal or not to Drupal… my mid-career challenge, a 1-year, 3-year, and 5-year plan for my career, and the Webform module\">To Drupal or not to Drupal… my mid-career challenge, a 1-year, 3-year, and 5-year plan for my career, and the Webform module</a></div><div class=\"message_embed_description\">As discussed in my previous blog post, the organization I have worked for more than twenty years in is moving away from Drupal to a new Digital Experience Platform (DXP). In turn, </div></div></div>",
        "id": 227387022,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614060729
    },
    {
        "content": "<hr>\n<p>Possible middle-man solution: <a href=\"https://opencollective.com/\">https://opencollective.com/</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://opencollective.com/\" style=\"background-image: url(https://opencollective.com/static/images/opencollective-og-default.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://opencollective.com/\" title=\"Open Collective\">Open Collective</a></div><div class=\"message_embed_description\">Make your community sustainable. Collect and spend money transparently.</div></div></div>",
        "id": 227387033,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614060753
    },
    {
        "content": "<p>Yeah, when it comes to the Drupal version of Webform specifically, but also the model of managing project maintenance in Drupal-land in general, I don't agree with the whole \"it's my baby\" thing ...life for the maintainer, as well the rate at which work would get done in the Webform issue queue would be much faster if that person would be willing to \"let go\" or simply agree to share maintenance responsibility ...my assumption (and I could be wrong about it, but still) is that this person must have \"crunched the numbers\" in their head, and thought that there's money to be made from the 400k sites using that module. ...I understand that in that article he talks about the hardship that he's fallen into, and I totally get how hard that must be; but it is a fact that these attempts to monetize the module did not happen just now with the whole global COVID crisis and the financial consequences it has brought along. This to me seems like a silly attempt to excuse the drive towards that end ...and I understand how hard my words and thinking may sound, but I strongly believe that open source should remain money-free at all costs, up to the point where feasible of course. ...each time money starts being involved in anything truly pure, things start going bad.</p>",
        "id": 227392332,
        "sender_full_name": "klonos",
        "timestamp": 1614066089
    },
    {
        "content": "<p>...case in point: <a href=\"https://www.drupal.org/node/7404/committers?sort=desc&amp;order=Commits\">https://www.drupal.org/node/7404/committers?sort=desc&amp;order=Commits</a></p>",
        "id": 227392384,
        "sender_full_name": "klonos",
        "timestamp": 1614066125
    },
    {
        "content": "<p>...to me, it seems that he's the only person maintaining the 8.x branch, which seems really odd for a module of that caliber.</p>",
        "id": 227392410,
        "sender_full_name": "klonos",
        "timestamp": 1614066158
    },
    {
        "content": "<p>...he should really open up to some help by the community.</p>",
        "id": 227392422,
        "sender_full_name": "klonos",
        "timestamp": 1614066177
    },
    {
        "content": "<p>I've posted this elsewhere just a moment ago, but I feel that I should also post it here as well:</p>\n<blockquote>\n<p>I would like to ask to please do not let my very hard-headed and opinionated view that \"money is evil and shouldn't be part of something as pure as open source\" come out as I don't want to hear what others have to say. My intention as a PMC member is to promote and work towards a better/healthy future for Backdrop as a product and a community <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span>️</p>\n</blockquote>",
        "id": 227394220,
        "sender_full_name": "klonos",
        "timestamp": 1614067570
    },
    {
        "content": "<p>Honestly, I don't have the time to read through all the links on this topic... but what has a D8 maintainer to do with monetizing Backdrop? Drupal has taken a different way than Backdrop did..!?</p>",
        "id": 227397555,
        "sender_full_name": "mazze.ch",
        "timestamp": 1614069712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"269428\">@mazze.ch</span> the blog posts are a prime example of what happens within a community when a for-profit company pulls their support and allegiance from an open-source community, usually because the open-source project is too slow to meet the demands of today's technologies.</p>\n<p>Long story short, the maintainer of the D8+ webform module works as an employee for a company that used Drupal for years. They are moving away from Drupal, which means the maintainer has no financial incentive to continue working on Webform in his free time.</p>\n<p>I have watched this has happen over and over in the Drupal community.</p>\n<p>My argument isn't to commercialize backdrop, but instead create a financial economy around it. Drupal has suffered because of its \"no money\" policy within the community. All I'm saying is that Backdrop will suffer exactly as Drupal has and will see the exact same results as Drupal because of this one ideology.</p>\n<p>When Drupal took on that ideology in the  early 2000s, that was the ideals of the times: 100% free for everyone! 20 years later, that landscape has changed drastically. Open source isn't about \"being free\", it's about sharing code and sharing code doesn't mean it can't somehow have a financial economy wrapped around it.</p>",
        "id": 227506976,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614115932
    },
    {
        "content": "<hr>\n<p>I apparently have to correct myself...</p>\n<p>When I say \"open source\" I'm referring to software.</p>\n<p>Thanks Google news for pointing out my lack of clarification.</p>\n<p><a href=\"https://www.redhat.com/en/blog/open-source-contributions-go-far-beyond-code\">https://www.redhat.com/en/blog/open-source-contributions-go-far-beyond-code</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://www.redhat.com/en/blog/open-source-contributions-go-far-beyond-code\" style=\"background-image: url(https://www.redhat.com/cms/managed-files/RH_OpenTech.gif)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://www.redhat.com/en/blog/open-source-contributions-go-far-beyond-code\" title=\"Open source contributions go far beyond code\">Open source contributions go far beyond code</a></div><div class=\"message_embed_description\">Code is the first thing that comes to mind when people think open source contributions. But it's not the only type of contribution, not even close. Brian Proffitt explains the importance of other contributions.</div></div></div>",
        "id": 227539216,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614134343
    },
    {
        "content": "<hr>\n<p>Can I get someone with permission to rename this threads topic please? It's been brought up that it gives the wrong impression to the overall topic.</p>",
        "id": 227555277,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614149094
    },
    {
        "content": "<p>What would you like for a title.</p>",
        "id": 227555343,
        "sender_full_name": "StPaulTim",
        "timestamp": 1614149148
    },
    {
        "content": "<p>Don't care. I'm not going to be held responsible for the new name <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 227555412,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614149198
    },
    {
        "content": "<p>I know, I shouldn't,... but can't resist to share some general thoughts about Open Source...</p>\n<p>In the Open Source ecosystem it's not uncommon that maintainers (or engaged contributors) leave a project. There are many possible reasons for that - change of interest, lack of time...</p>\n<p>A proprietary (closed source) software project would certainly die with that, but not necessarily an Open Source project. Why? Because the source code is available, and anyone can fork it. If there's an interested community, someone with sufficient skills can take over. I saw this happen many times.</p>\n<p>So my conclusion: it's mainly the availability of source code, that can guarantee the continuation of a project. Given that enough people are interested in the project. Payment can be nice, but is secondary IMO.</p>\n<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> I know we disagree, but I wanted to describe my point of view. At the risk of getting a bunch of (possibly unfriendly) responses.</p>",
        "id": 227555762,
        "sender_full_name": "indigoxela",
        "timestamp": 1614149465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256738\">@indigoxela</span> no, you are 100% right. </p>\n<p>That is only one side of the coin though.</p>",
        "id": 227556611,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614150088
    },
    {
        "content": "<p>Thank you for the summary <span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> :-) But IMHO, if Drupal 8 would have be more \"backdropish\" back then, Drupal would not have lost so much developers. The \"there's a module for that\" was possible because the entry barrier was rather low. I think that D8 and BD have taken very different directions, both of them are OK, but Backdrop is still way too small to attract commercial vendors (e.g. Theme developers) at this point.</p>",
        "id": 227564014,
        "sender_full_name": "mazze.ch",
        "timestamp": 1614155364
    },
    {
        "content": "<blockquote>\n<p>if Drupal 8 would have be more \"backdropish\" back then, Drupal would not have lost so much developers</p>\n</blockquote>\n<p>I agree and would even extend that to \"if Drupal 7 would have been more community-oriented...\", because the step from 6 to 7 already caused many people to leave. The step from 7 to 8/9 could (worst case) turn out to be the mortal blow. At least, IMO it's a change regarding the market sector. Less projects, but (potentially) more profitable ones. Orientation towards professional market, away from community.</p>\n<p>Unfortunately, this also means some sort of brain drain for Drupal. Hopefully Backdrop can include at least a part of these disappointed and/or frustrated members.</p>\n<blockquote>\n<p>Backdrop is still way too small to attract commercial vendors</p>\n</blockquote>\n<p>I also agree on that, although I'm possibly a little more optimistic, that this might change in the future. However, that's nothing I rely on or consider necessary. For me the backbone of Backdrop is the community.</p>\n<p>Another thought: a lack of interest in the community, or even worse, severe disagreement inside a community, could never get compensated with money.<br>\nHowever, I'd appreciate sponsored contrib projects, or sponsored work on core (bugs). If vendors do it in their own interest - fine, as long as it complies with Backdrops philosophy. But that's nothing that has high prio for me in any way, it's just something that can happen and is OK.</p>",
        "id": 227573222,
        "sender_full_name": "indigoxela",
        "timestamp": 1614160335
    },
    {
        "content": "<p>Taking the option of money away from people who can only contribute financially, makes for a one-sided community. It's unfair to exclude community members from having the opportunity to help directly grow the platform because they can't give their time.</p>\n<p>This topic isn't just about people in the community making money. It's more importantly about people being able to spend money to get things fixed that plague their workflow. Yes, people can spend money outside of Backdrop to get it done, but that comes with huge overhead. I know from experience.</p>",
        "id": 227659917,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614195978
    },
    {
        "content": "<hr>\n<p>I don't want to solve the problem of \"how can people make money\" because that will solve itself if we can solve the real problem.</p>\n<p>The real problem I want to solve is \"how can people/organizations spend money to get the things done that they need done, with little overhead.\"</p>",
        "id": 227660178,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614196105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> - I think that your last point here is an interesting one and worth talking more about. I'd like to come up with some specific proposals for how to address that problem.</p>",
        "id": 227661363,
        "sender_full_name": "StPaulTim",
        "timestamp": 1614196643
    },
    {
        "content": "<p>I have ideas, but they need to be written up in more detail.</p>",
        "id": 227661416,
        "sender_full_name": "StPaulTim",
        "timestamp": 1614196669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> sounds good. You've mentioned getting a backdrop live going for more discussion. I think it's a good idea.</p>\n<p>I personally would like to hold off until later spring to get these going due to personal projects I need to focus on but if it's sooner I'm sure I can make it work.</p>",
        "id": 227662543,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614197075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> I'm not saying to take away the option of donating money to the project. ...just saying that donating for specific projects, issues, and members of the community is a potential big can of worms. ...it may for example lead to \"non-80%\" features ending up in core or in contrib projects, or to people/entities with money leading product decisions. Backdrop should still allow donations of course, so that we can sustain our infrastructure etc.</p>",
        "id": 227708838,
        "sender_full_name": "klonos",
        "timestamp": 1614220084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> those items are at the top of the discussion list. I agree with those concerns as do others. How that looks exactly, needs thoughtful discussion.</p>",
        "id": 227711435,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614222608
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/Funding.20Backdrop.20Development/near/227708838\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"330989\">Phil Ward</span> I'm not saying to take away the option of donating money to the project. ...just saying that donating for specific projects, issues, and members of the community is a potential big can of worms. ...it may for example lead to \"non-80%\" features ending up in core or in contrib projects, or to people/entities with money leading product decisions. Backdrop should still allow donations of course, so that we can sustain our infrastructure etc.</p>\n</blockquote>\n<p>I have been holding myself back from engaging in any discussions pertaining monetization, commercialization or funding Backdrop so far. Not planning to start actively participating either, because unfortunately I have other priorities at the present. I just would like to express my hope here that all kind of ideas will be welcomed, explored and some possibly even entertained; that nobody will be shut/feared off just because of strong positions of the community leaders and activists.</p>\n<p>As for the above particular opinion of @klonos I do really disagree, because there are plenty of Drupal 7 projects which rely on specific contributed or custom modules and if their owners decide to financially support development of only those Backdrop projects which they need and which not necessarily fall into \"non-80%\" category, then it's really nobody's, but their only business. It's not really about getting those kind of projects into core or letting people/entities with money influence decisions about Backdrop project. The community can be safely growing further within the principles set by the current project leads, however at the same time I believe it would be a really big mistake to push away any parties which would like to start financially supporting - core, contributed modules, themes or whatever they only need - really doesn't matter. </p>\n<p>Let's just be open-minded and explore all kind of possibilities. I said it before and I will keep repeating: Backdrop have a realistic chance to beat WordPress! However, to do so the decision-takers in Backdrop community need to be really agile.</p>",
        "id": 227711733,
        "sender_full_name": "Alan Mels",
        "timestamp": 1614222888
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> for brining up this topic again. We had a lengthy discussion about how to raise money for Backdrop (and what to spend it on) back in the very early days of Backdrop, but it is high time we have the conversation again. I'm going to try to dig up a list of the ideas we had back then. They might still be valid, they might not be relevant anymore :)</p>",
        "id": 227865810,
        "sender_full_name": "jenlampton",
        "timestamp": 1614301112
    },
    {
        "content": "<p>Just got linked here by <span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> and I think it's an interesting discussion.  I think I come at it from a different angle maybe: I'm a commercial developer who is moving solely to backdrop from d7.  Honestly (try not to gasp) it's not because I want to grow backdrop or make it better.  Its because its the best tool for the job, as I see it.  </p>\n<p>My clients dont really care whether I use Backdrop or something else...they just want the job done well.  That means I'll help 'fund' backdrop by doing work my clients need done, then contributing that work to make backdrop better.  It may also mean hiring developers here to get stuff done that I can't do.  </p>\n<p>I think a big difference is this:  I understand the Backdrop ecosystem (like I understood D7) so my 'funding' would never be to scratch my specific itch (ie. a non-80% feature) that goes against 'how things should be done'.  I work within the framework, so everything I do would be 'selfish' (its not really 'for the good of the community', it's because I make money, my clients get websites), but at the same time its good for backdrop.  </p>\n<p>I guess I'd say dont assume everyone wants to help backdrop for the sake of backdrop (writing off those who contribute for 'selfish' reasons).  Most 'commercial' devs will help because its good for them AND for backdrop. I want backdrop to succeed because it's good for me AND good for the community.  Sometimes I feel like that perspective is missed and that everyone is supposed to be working on improving the project selflessly. (ie. for free)  To those who do that I have MAJOR respect...but thats not me, for better or worse..and it wasn't the case with D7 either.</p>",
        "id": 228458199,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614708834
    },
    {
        "content": "<p>(and that was much longer than I intended...sorry 'bout that :) )</p>",
        "id": 228459728,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614709428
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> thanks for your perspective. There are two main schools of thought which need a LOT of discussion still to hopefully, someday, come to a compromise that will appease both ideologies.</p>\n<p>I personally believe we can find an excellent compromise but it's going to take some time and good ideas from many members to pull it off.</p>\n<p>Feel free to throw in any ideas or concerns. I know I can't think of everything.</p>",
        "id": 228459746,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614709435
    },
    {
        "content": "<p>I guess I don't understand the issue fully.  I don't see why it matters how/why people are contributing.  Are we just talking about money influencing the direction of the project?  Without them being able to directly affect core, I guess I dont understand the problem.  If they want to make wacky/stupid modules, that scratch their own itch,  is that a problem?</p>",
        "id": 228460113,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614709548
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/Funding.20Backdrop.20Development/near/227708838\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"330989\">Phil Ward</span> ...donating for specific projects, issues, and members of the community is a potential big can of worms. ...it may for example lead to \"non-80%\" features ending up in core or in contrib projects, or to people/entities with money leading product decisions. </p>\n</blockquote>\n<p>This, however, makes sense to me.  Its more about using money to influence overall project direction, as opposed to being paid to work in Backdrop, then contributing.  I think those are 2 different things (so maybe I was misunderstanding the whole discussion)</p>",
        "id": 228460923,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614709851
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> the original discussion was opened as a very general topic because I felt like we needed to figure out where the discussion needed attention.</p>\n<p>I think the main consensus is \"don't let money dictate the outcome of Backdrop\". I agree with this as well but it wasn't clear in the beginning.</p>\n<p>There are a few other issues to discuss and work through, but the discussion has stared to take shape such that we have some pin-pointed talking points to work around.</p>",
        "id": 228461456,
        "sender_full_name": "Phil Ward",
        "timestamp": 1614710032
    },
    {
        "content": "<p>Yup, makes sense. I know 'core people' can't say this (because its not politically correct), but I can:  This was the sickness that happened in Drupal.  I was constantly disgusted by the influence of Acquia on the whole thing.  And, in the end, IMO thats why D8 sucked and I left. :)</p>",
        "id": 228461729,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614710121
    },
    {
        "content": "<p>I think that is the primary thing they are trying to avoid with the money in Backdrop issue.</p>",
        "id": 228462326,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1614710358
    },
    {
        "content": "<p>I feel like the question is more about who the leaders / project leads are.  If theyre not people who are going to monetize Backdrop for their own gain, then the project is safe from influence.</p>",
        "id": 228462859,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614710550
    },
    {
        "content": "<p>I guess it seems like this is more about policy for leadership and less about 'who can contribute', maybe.</p>",
        "id": 228462989,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614710597
    },
    {
        "content": "<blockquote>\n<p>...I was constantly disgusted by the influence of Acquia on the whole thing. And, in the end, IMO thats why D8 sucked and I left. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>\n<p>Amen brother! <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 228463567,
        "sender_full_name": "klonos",
        "timestamp": 1614710797
    },
    {
        "content": "<p>So, question that puts it very simply (maybe too simply):  Who is the competition for Backdrop?  Is it Wordpress?  Drupal 8/9/etc?  Or Drupal 7 for now, but nobody else later?  (I'm just trying to really nail down understanding the mentality of features and what direction everyone wants those to go)</p>",
        "id": 228797983,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614873577
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"298007\">Rob Feature</span> <a href=\"#narrow/stream/218635-Backdrop/topic/Feature.20Survey.20Results.20(latest.20update)/near/228797983\">said</a>:</p>\n<blockquote>\n<p>So, question that puts it very simply (maybe too simply):  Who is the competition for Backdrop?  Is it Wordpress?  Drupal 8/9/etc?  Or Drupal 7 for now, but nobody else later?  (I'm just trying to really nail down understanding the mentality of features and what direction everyone wants those to go)</p>\n</blockquote>\n<p>It is actually really nice question. Even-though we all know that de-facto historically, culturally, code-wise Backdrop is and will be for long time died up to Drupal, I believe it would be really good if it started to aim the much larger market of WordPress, and accordingly start making changes that would make easier to reach out to WordPress users. At least UI-wise.</p>",
        "id": 228816293,
        "sender_full_name": "Alan Mels",
        "timestamp": 1614879342
    },
    {
        "content": "<blockquote>\n<p>I believe it would be really good if it started to aim the much larger market of WordPress, and accordingly start making changes that would make easier to reach out to WordPress users. At least UI-wise.</p>\n</blockquote>\n<p>Honestly I think this is my fear:  Personally I don't believe any system at this point can 'compete' with Wordpress.  Its too big and has already captured the market, plus its SO UI oriented that its target market basically rules out custom development (not completely, but pratically).  </p>\n<p>Personally I feel like Backdrop should serve a market thats in-between.  That was the power of D7, the failing of D8 and the downfall of Wordpress.  It should be totally accessible for custom devs to build complex custom sites, while being 'simple enough' that custom-needs-oriented folks can build cool stuff in the UI.  I feel like it has a chance to sit in this really nice space in between that nobody really serves.  Its not for Computer Scientists...but it's also not for people that know so little that they're the target market of Wordpress (or squrespace for that matter)</p>\n<p>Thats just my 2 cents.</p>",
        "id": 228818951,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614880319
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> I agree with your thoughts. You see, if Backdrop started to make changes towards WordPress market, it wouldn't arrive there soon, instead it would end up just where you want it to be: somewhere in-between.</p>",
        "id": 228819888,
        "sender_full_name": "Alan Mels",
        "timestamp": 1614880669
    },
    {
        "content": "<p>Yeah, I can see that.  However, I also could see it serving nobody.   It wouldn't do UI stuff as well as Wordpress, and there might be alot of barriers put up to custom development by having complicated UI-related functionality.   I feel like this was where D7 was headed but (luckily) never got:  It poured a ton of effort into trying to compete with Wordpress UI-built layouts, but it couldn't really do it.  It was frankly too hard/time consuming to catch up.  So instead we ended up with things like Panels that, once installed, just inhibit simpler development.</p>",
        "id": 228820338,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614880809
    },
    {
        "content": "<blockquote>\n<p>Personally I feel like Backdrop should serve a market thats in-between.</p>\n</blockquote>\n<p>Though I cannot at the moment find it written down, I have heard <span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span> make the statement many times that Backdrop is for sites that are between WordPress and D8/9.</p>\n<blockquote>\n<p>It should be totally accessible for custom devs to build complex custom sites, while being 'simple enough' that development-oriented folks can build cool stuff in the UI.  I feel like it has a chance to sit in this really nice space in between that nobody really serves.  Its not for Computer Scientists...but it's also not for people that know so little that they're the target market of Wordpress (or squrespace for that matter)</p>\n</blockquote>\n<p>This page does not entirely agree with your statements there: <a href=\"https://backdropcms.org/philosophy\">https://backdropcms.org/philosophy</a></p>",
        "id": 228820381,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1614880823
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256627\">oadaeh (Jason Flatt)</span> <a href=\"#narrow/stream/218635-Backdrop/topic/Feature.20Survey.20Results.20(latest.20update)/near/228820381\">said</a>:</p>\n<blockquote>\n<p>Though I cannot at the moment find it written down, I have heard <span class=\"user-mention silent\" data-user-id=\"263951\">jenlampton</span> make the statement many times that Backdrop is for sites that are between WordPress and D8/9.</p>\n</blockquote>\n<p>Which is what I always think about Backdrop:  \"It's drupal 7 but more rad (and modern)\"</p>",
        "id": 228820629,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614880888
    },
    {
        "content": "<p>I think it's also important to recognize the reality:  Starting next fall/winter, the vast majority of Backdrop users will be people that just wanted to use Drupal 7 because it fit their needs. (ie. this 'in-between' space)</p>",
        "id": 228820823,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614880969
    },
    {
        "content": "<p>and yeah <span class=\"user-mention\" data-user-id=\"256627\">@oadaeh (Jason Flatt)</span> , I know what you mean about it not really agreeing with the philosophy I have.  Its targeted at \"the editor and architect over the needs of the developer\".  To me that means \"We intend to compete with Wordpress, not be a 'newer, more rad, Drupal 7'</p>",
        "id": 228821109,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614881059
    },
    {
        "content": "<p>Is someone talking about Wordpress again?</p>",
        "id": 228821111,
        "sender_full_name": "Dragonbot",
        "timestamp": 1614881060
    },
    {
        "content": "<p>When I hear people say that they don't know if Backdrop can handle a particular big or complex site, I think about sites like <a href=\"http://publicnow.com\">publicnow.com</a>, <a href=\"http://whitehouse.gov\">whitehouse.gov</a>, <a href=\"http://economist.com\">economist.com</a>, etc., which were all built on early versions of D7, and I know Backdrop could do the same only better.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"http://whitehouse.gov\" style=\"background-image: url(https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"http://whitehouse.gov\" title=\"The White House\">The White House</a></div><div class=\"message_embed_description\">Learn how the Biden-Harris Administration is tackling our nation’s challenges and building our country back better from this crisis.</div></div></div>",
        "id": 228821203,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1614881107
    },
    {
        "content": "<p>THIS ^^^^^^^^</p>",
        "id": 228821249,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614881122
    },
    {
        "content": "<p>When I talk to clients about Backdrop and they've never heard of it (and therefore are afraid of its small and 'new' user base) i just say: \"look.  This is Drupal 7 but better . Literally, almost all the code is the same thats powering these huge sites (and most likely the site we're upgrading)\"</p>",
        "id": 228822775,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614881707
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"298007\">Rob Feature</span> <a href=\"#narrow/stream/218635-Backdrop/topic/Feature.20Survey.20Results.20(latest.20update)/near/228818951\">said</a>:</p>\n<blockquote>\n<p>Honestly I think this is my fear:  Personally I don't believe any system at this point can 'compete' with Wordpress.  Its too big and has already captured the market, plus its SO UI oriented that its target market basically rules out custom development (not completely, but pratically).  </p>\n</blockquote>\n<p>I think that this ties in very heavily with the monitization issue. I know lots of people who have built Wordpress sites or are looking into that because a service they paid for is only available through a Wordpress plugin. They do not know of care about Wordpress at all they just know that someone said a Wordpress plugin would solve their business requirements.<br>\nWe currently cannot do that because people think that you should not be allowed to pay module developers for the modules they maintain.</p>",
        "id": 228826725,
        "sender_full_name": "Joseph Flatt",
        "timestamp": 1614883117
    },
    {
        "content": "<p>Yeah, but this is exactly why I steer clients away from Wordpress:  \"Do you want to keep paying for a module that you need?  Or do you want it built once and never pay again\"</p>",
        "id": 228826883,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614883186
    },
    {
        "content": "<p>I've built custom modules for a reasonable price (becuase D7 is so easy to build with) that they used for many many years for 'free' after it was built.</p>",
        "id": 228827049,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614883235
    },
    {
        "content": "<p>But you comment is exactly what I hear:  \"So and so told me that Wordpress was the easy solution\".  These are the 'know nothing' people (not meant as an insult) that Wordpress has alot of and I think Backdrop should steer clear of.</p>",
        "id": 228827228,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614883309
    },
    {
        "content": "<p>I am a module developer. Those people are willing to pay for modules.</p>",
        "id": 228827390,
        "sender_full_name": "Joseph Flatt",
        "timestamp": 1614883363
    },
    {
        "content": "<p>We either attract those people or we need Acquia to pay all the module developers</p>",
        "id": 228827491,
        "sender_full_name": "Joseph Flatt",
        "timestamp": 1614883406
    },
    {
        "content": "<p>Yeah, i'm not sure I follow exactly, but I suspect we're on opposite sides of the argument. :)</p>",
        "id": 228828502,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614883763
    },
    {
        "content": "<p>Personal opinion: I'm not against people getting paid for developing modules but I am against an ecosystem that encourages separate payments (especially recurring subscriptions) for each module needed, with each developer trying to build their own monetized silo in one way or another. Heavily in favor of people getting paid to spend time improving a module and then releasing those improvements to the project/module without additional fee. Relatedly, I'm also not a fan of Freemium/Premium type plugins that try to bait and switch. I get the arguments about attracting developers with the promise of module-subscription-based cash but since I don't like that outcome for the ecosystem... I'm not as young as I used to be but hey, still got some of that idealism. <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 228829723,
        "sender_full_name": "Laryn",
        "timestamp": 1614884222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256573\">@Laryn</span> Agree 100%.  Get paid to work on modules/sites, not sell modules.  That small distinction sets up a drastically different environment for the platform/community.</p>",
        "id": 228829930,
        "sender_full_name": "Rob Feature",
        "timestamp": 1614884292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298007\">@Rob Feature</span> re Drupal vs WordPress and market share/target and where Backdrop fits in all that, this graph always comes to mind: <a href=\"/user_uploads/18319/Gj1TzRMbJVeazOAdW3vJJwLW/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/18319/Gj1TzRMbJVeazOAdW3vJJwLW/image.png\" title=\"image.png\"><img src=\"/user_uploads/18319/Gj1TzRMbJVeazOAdW3vJJwLW/image.png\"></a></div>",
        "id": 229181005,
        "sender_full_name": "klonos",
        "timestamp": 1615117326
    },
    {
        "content": "<p>Is someone talking about Wordpress again?</p>",
        "id": 229181006,
        "sender_full_name": "Dragonbot",
        "timestamp": 1615117326
    },
    {
        "content": "<p>...originally used here I believe: <a href=\"https://www.quora.com/Will-BackDrop-CMS-the-fork-of-Drupal-7-be-a-viable-alternative-to-Drupal-8-or-will-it-fail-What-factors-will-determine-its-success-or-failure\">https://www.quora.com/Will-BackDrop-CMS-the-fork-of-Drupal-7-be-a-viable-alternative-to-Drupal-8-or-will-it-fail-What-factors-will-determine-its-success-or-failure</a></p>",
        "id": 229181036,
        "sender_full_name": "klonos",
        "timestamp": 1615117370
    },
    {
        "content": "<p>...and then the sadness that comes by seeing that graph prediction being true re Drupal usage: <a href=\"https://www.drupal.org/project/usage/drupal\">https://www.drupal.org/project/usage/drupal</a></p>",
        "id": 229181144,
        "sender_full_name": "klonos",
        "timestamp": 1615117474
    },
    {
        "content": "<p>For those who have not noticed yet, we have a discussion scheduled for tomorrow (today) on Funding Backdrop Development. This topic does not show up on the main website, because it's happening outside of our official time blocks. However, it is open to everyone and is still listed on the Google Doc.</p>\n<p><a href=\"http://bit.ly/3e5zfrN\">http://bit.ly/3e5zfrN</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"http://bit.ly/3e5zfrN\" style=\"background-image: url(https://lh3.googleusercontent.com/b4f0QZEGXKSC2CGRwZLwZ1uKq9X8x8KkS4Qx9rKb3Kw5ssSOHsZLNqoRt7ad2J_Gbglb7KuCzsthaQ=w1200-h630-p)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"http://bit.ly/3e5zfrN\" title=\"Backdrop LIVE Schedule\">Backdrop LIVE Schedule</a></div><div class=\"message_embed_description\">Sheet1\n\nShort link to this document: &lt;a href=\"http://bit.ly/3e5zfrN\"&gt;http://bit.ly/3e5zfrN&lt;/a&gt;,&lt;a href=\"https://events.backdropcms.org/\"&gt;Register for Backdrop LIVE&lt;/a&gt;\nAnyone can suggest a topic for the schedule. Contact us in Zulip or on the &lt;a href=\"http://events.backdropcms.org/\"&gt;events.backdr...</div></div></div>",
        "id": 229980442,
        "sender_full_name": "StPaulTim",
        "timestamp": 1615528270
    },
    {
        "content": "<p>Our discussion about Funding Backdrop Development is happening in 30 minutes in our Backdrop LIVE zoom room</p>",
        "id": 230077175,
        "sender_full_name": "StPaulTim",
        "timestamp": 1615574119
    },
    {
        "content": "<p>Is this over? Had to go on the road.</p>",
        "id": 230078983,
        "sender_full_name": "docwilmot",
        "timestamp": 1615574928
    },
    {
        "content": "<p>Looks like it hasn't started yet! Starts on the hour.</p>",
        "id": 230079093,
        "sender_full_name": "jackaponte",
        "timestamp": 1615574995
    },
    {
        "content": "<p>It starts in about 7 minutes.</p>",
        "id": 230079615,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1615575190
    },
    {
        "content": "<blockquote>\n<p>Starts on the hour.</p>\n</blockquote>\n<p>I read that as \"Starts in an hour.\"</p>",
        "id": 230079710,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1615575239
    },
    {
        "content": "<p>That's me jumping to conclusions again. <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>",
        "id": 230079813,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1615575281
    },
    {
        "content": "<p>Hope discussion/decisions can be documented somewhere for those of us who couldn't attend...</p>",
        "id": 230088023,
        "sender_full_name": "BWPanda",
        "timestamp": 1615578998
    },
    {
        "content": "<p>FOMO <span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> ? <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span> ...in all seriousness though, yes, I believe that some notes are being taken, and I'm sure that they will make their way into an issue queue, or blog post, or Zulip stream.</p>",
        "id": 230088910,
        "sender_full_name": "klonos",
        "timestamp": 1615579358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> No decisions made, it was purely discussion to bubble some ideas and thoughts for future discussion.</p>\n<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> I was unclear on \"where\" <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> was saying to put this... <a href=\"http://backdropcms.org\">backdropcms.org</a> or the github for <a href=\"http://backdropcms.org\">backdropcms.org</a>? Makes me wonder if we need a specific repository (if in github) that would be specific for the organization? Maybe use the new github discussions for this?</p>",
        "id": 230089406,
        "sender_full_name": "Phil Ward",
        "timestamp": 1615579553
    },
    {
        "content": "<blockquote>\n<p>FOMO <span class=\"user-mention silent\" data-user-id=\"256607\">BWPanda</span> ? <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></p>\n</blockquote>\n<p>Of course. As an active member of the Backdrop community, I like being involved in discussions and decision-making. Virtual meetings are a struggle for me, because of timezone differences and family life/commitments. I've made my peace with generally missing the weekly meetings as at least they're recorded and I can watch them after the fact. But when I can't attend other virtual events/discussions and they're not recorded, then it really does feel like I'm missing out, and there's nothing I can do about it other than beg people to fill me in later...</p>",
        "id": 230090073,
        "sender_full_name": "BWPanda",
        "timestamp": 1615579820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> - My default answer about where to put this kind of discussion would be in the <a href=\"http://backdropcms.org\">backdropcms.org</a> issue queue. My point is that without a decision to put this discussion elsewhere, that is the place I would expect this discussion to go. </p>\n<p>However, it might be that we can come up with a different idea for this specific discussion. But, that will take a little time. In the meantime, I recommend <a href=\"http://backdropcms.org\">backdropcms.org</a> issue queue</p>",
        "id": 230090205,
        "sender_full_name": "StPaulTim",
        "timestamp": 1615579882
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span> The <a href=\"http://backdropcms.org\">backdropcms.org</a> repo is used for general organisation things as well as website-specific things.</p>",
        "id": 230090226,
        "sender_full_name": "BWPanda",
        "timestamp": 1615579892
    },
    {
        "content": "<p><a href=\"https://github.com/backdrop-ops/backdropcms.org\">https://github.com/backdrop-ops/backdropcms.org</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/backdropcms.org\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/backdropcms.org\" title=\"backdrop-ops/backdropcms.org\">backdrop-ops/backdropcms.org</a></div><div class=\"message_embed_description\">Issue tracker for the BackdropCMS.org website. Contribute to backdrop-ops/backdropcms.org development by creating an account on GitHub.</div></div></div>",
        "id": 230090695,
        "sender_full_name": "StPaulTim",
        "timestamp": 1615580091
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> And it's not just a <em>fear</em> of missing out, I literally am missing out. Especially on the continuation of a discussion that I've been involved with and following for months now.</p>",
        "id": 230091006,
        "sender_full_name": "BWPanda",
        "timestamp": 1615580248
    },
    {
        "content": "<p>I know it's not the same as being there, but we did take pretty good notes. <br>\n<a href=\"https://docs.google.com/document/d/1KkZzdQV4yNZ1lQK7Y1WlNVsHWMnfZZjh7lYwZG1RF2U/edit\">https://docs.google.com/document/d/1KkZzdQV4yNZ1lQK7Y1WlNVsHWMnfZZjh7lYwZG1RF2U/edit</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://docs.google.com/document/d/1KkZzdQV4yNZ1lQK7Y1WlNVsHWMnfZZjh7lYwZG1RF2U/edit\" style=\"background-image: url(https://lh6.googleusercontent.com/EUVPdXP12tdYC9jftGWPpSrQiOO6DCYqhpiVoSjBPPgjpcOrdGPWpPfEPFqR1jhakFOkzYtVtwWiTA=w1200-h630-p)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://docs.google.com/document/d/1KkZzdQV4yNZ1lQK7Y1WlNVsHWMnfZZjh7lYwZG1RF2U/edit\" title=\"Funding Backdrop Development\">Funding Backdrop Development</a></div><div class=\"message_embed_description\">Funding Backdrop Development\u000bBackdrop LIVE \u000bMarch 12, 2021  Notes  How does a site owner find and compensate developers to help them solve problems.  How do we as a community improve the economic ecosystem around Backdrop CMS? What can we learn from Wordpress community what can we teach other com...</div></div></div>",
        "id": 230091622,
        "sender_full_name": "StPaulTim",
        "timestamp": 1615580553
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> I hear you! I spoke to how this was just a discussion, with no decisions being made (not even \"next steps\" really), and that if folks were inspired to see something move or make something happen, they should bring it to the larger community via Zulip or, even better, GitHub, places where folks can catch up asynchronously</p>",
        "id": 230092529,
        "sender_full_name": "jackaponte",
        "timestamp": 1615580865
    },
    {
        "content": "<p>I literally was about to say what <span class=\"user-mention\" data-user-id=\"262176\">@jackaponte</span> said ^^ ...no decision was made (nor did anyone think that it was to be made) during that discussion.</p>",
        "id": 230092700,
        "sender_full_name": "klonos",
        "timestamp": 1615580926
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> Ok and understood.</p>\n<p>I have opened a new topic around the discussion about creating a new github group that can house all things that aren't there to fix code or the text on the sites. I personally feel that <a href=\"http://backdropcms.org\">backdropcms.org</a> queue should be reserved for the site issues and there should be a new group for \"organization/community\" issues. Otherwise, the <a href=\"http://backdropcms.org\">backdropcms.org</a> queue becomes too cluttered with site vs community issues and it becomes difficult to distinguish between the site and the community.</p>\n<p><a href=\"#narrow/stream/218635-Backdrop/topic/New.20Github.20Group.20For.20Community.20Discussion\">https://backdrop.zulipchat.com/#narrow/stream/218635-Backdrop/topic/New.20Github.20Group.20For.20Community.20Discussion</a></p>",
        "id": 230094121,
        "sender_full_name": "Phil Ward",
        "timestamp": 1615581554
    }
]