[
    {
        "content": "<p>So I'm looking at my list of things to do and I'm seeing quite a bit that's not so much as a learning curve but a learning cliff. Might as well sound out of any of you are willing to work for money. There's a caveat: the website this is building is also our business model, meaning that payment is going to have to be on some kind of deferred model to start—but afterwards, switch to normal. (I'm an IT guy. I'm not asking for pro bono work unless someone here really grooves on our science educational mission, and I fully intend to treat you and your bank account with respect.)</p>\n<p>What I think is needed:</p>\n<ul>\n<li>Support work taking over programming that's just beyond me and not likely to be graspable in the short term</li>\n<li>Handholding for a walkthrough for such things I <em>can</em> do with a little assistance the first time</li>\n<li>The wisdom to know the difference</li>\n<li>Overall redo of the design and maybe UI; right now, the site is heavily Basis and text-only</li>\n<li>Eventually, part of our student leadership initiative will involve handing this off to students for at least maintenance and some programming; this might need training or more assistance.</li>\n</ul>\n<p>In other words, it's a long-term thing, and obviously people willing to do some work under less-than-optimal payment arrangements will be first in line for when we have a normal business arrangement. Bonus if you have CiviCRM or OpenSocial experience, as I'm assuming right now I'll need different people there.</p>\n<p>Any takers? Please email me at <a href=\"mailto:jeff@spusa.org\" title=\"mailto:jeff@spusa.org\">jeff@spusa.org</a> so I don't miss a message here.</p>",
        "id": 197077143,
        "sender_full_name": "Jeff Porten",
        "timestamp": 1589142947
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"294810\">@Jeff Porten</span> I sent you an email.</p>",
        "id": 197082284,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1589149396
    },
    {
        "content": "<p>I would say I \"really grooves on our science educational mission\": started life as a highschool physics teacher. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>  Glad <span class=\"user-mention\" data-user-id=\"256627\">@oadaeh (Jason Flatt)</span> can help.</p>",
        "id": 197091990,
        "sender_full_name": "docwilmot",
        "timestamp": 1589162311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256757\">@docwilmot</span> if you want to help out, I'm happy to stay out of your way. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 197094684,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1589166088
    },
    {
        "content": "<p>Oh no, please, I am unreliable timewise, and inexperienced in anything but writing code. Jeff sounds like he needs much more than I could offer. Happy to help if needed tho.</p>",
        "id": 197095070,
        "sender_full_name": "docwilmot",
        "timestamp": 1589166793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256757\">@docwilmot</span>  Would you mind sending me an email at <a href=\"mailto:jeff@spusa.org\">jeff@spusa.org</a> so I can more easily remind myself that you grooves on our mission? :-) I fear information I read here may be labelled \"ephemeral\" in my head.</p>",
        "id": 197227023,
        "sender_full_name": "Jeff Porten",
        "timestamp": 1589248260
    }
]