[
    {
        "content": "<p>IMO, the <code>type - *</code> labels in the core issue queue are special in that, I believe, all issues should be labelled with at least of of these. To that end, I've just finished going over the issue queue over the last few days and adding one of those <code>type</code> labels to any issue without one already. I've also made a bookmark for myself of issues without a <code>type</code> label so I can fix future ones from time-to-time. Feel free to use a different <code>type</code> label if I mis-identified any issues...</p>",
        "id": 213137580,
        "sender_full_name": "BWPanda",
        "timestamp": 1602586392
    },
    {
        "content": "<p>That's helpful. I've changed other people's issue type. Usually when they're really eager for a fix so they make it a bug issue</p>",
        "id": 213141249,
        "sender_full_name": "Herb",
        "timestamp": 1602588978
    },
    {
        "content": "<p>I also try to be setting those as I come across issues without any. I usually find that people may also categorize issues as features when they are tasks, and vice versa.</p>",
        "id": 213407282,
        "sender_full_name": "klonos",
        "timestamp": 1602759034
    },
    {
        "content": "<p>Yeah, I've been using 'Feature request' when someone's asking for something to be added/removed/changed but others may disagree or feedback is required to see if there's agreement that's it's the best way forward. And then 'Task' for things on which there's already a general consensus and/or no feedback required.</p>",
        "id": 213408359,
        "sender_full_name": "BWPanda",
        "timestamp": 1602759807
    },
    {
        "content": "<p>I usually add \"feature\" to things that are completely new functionality, and when the change is big enough to warrant it being introduced in a minor release. I see \"tasks\" as something between \"features\" and bugs. (it's a loophole <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>)</p>",
        "id": 213409285,
        "sender_full_name": "klonos",
        "timestamp": 1602760490
    },
    {
        "content": "<p>Also, I use 'Task' for Meta issues.</p>",
        "id": 213499697,
        "sender_full_name": "BWPanda",
        "timestamp": 1602803758
    }
]