[
    {
        "content": "<p>This is the first time I've had a chance to set up a Drupal 8 site from scratch so I'm just now finding some comparisons with Backdrop. The one thing I like is that the staging config directory in Drupal 8 doesn't get emptied after it is synced with the live config (in D8 it's actually only one sync directory but it's equivalent to staging). I don't know if it would cause problems if the staging config was left but it also causes problems if it's wiped every time. For instance, on Pantheon it causes issues when trying to keep config in the repo but the repo is not writable on live.</p>\n<p>I may create a github issue to allow for this change (maybe optional). But just wondering what other people think and what approaches you might take</p>",
        "id": 196368048,
        "sender_full_name": "Herb",
        "timestamp": 1588712823
    },
    {
        "content": "<p>I believe that it all depends on how things are set up. The way things work in the GovCMS platform for GovCMS 8 is this:</p>\n<ol>\n<li>do dev work on your local.</li>\n<li>export config and commit -&gt; push</li>\n<li>CI runs -&gt; if green, a deployment is triggered for the respective Lagoon environment (<code>master</code> branch is prod/live, every other branch is secondary environments, staging, UAT etc.)</li>\n<li>during the deployment, <code>drush cim</code> happens, so config is being imported<br>\n...all that is fine in theory, but there are many gov agencies that do not have an internal dev team, and their dev partners (digital agencies) are only engaged in an ad-hoc manner. That means that if config changes happen directly on their live site, there usually is nobody to export the config changes and commit them to the repo. This in turn causes all the changes to be reverted/lost next time dev work is done ...unless the dev partner has been bitten by this before, and the first thing they do is sync the db on their local with prod, and export-&gt;push code to the repo.</li>\n</ol>",
        "id": 196655590,
        "sender_full_name": "klonos",
        "timestamp": 1588780626
    },
    {
        "content": "<p>...in other words, I very much like the way config works in Backdrop compared to D8.</p>",
        "id": 196655631,
        "sender_full_name": "klonos",
        "timestamp": 1588780647
    },
    {
        "content": "<p>...I guess that depending on your setup you can get into similar situations with Backdrop, but if you only have a single config directory (small sites), config is being read/written directly instead of having to export/import/sync all the time.</p>",
        "id": 196656612,
        "sender_full_name": "klonos",
        "timestamp": 1588780992
    },
    {
        "content": "<p>Slightly tangentially related, I'm curious how people are currently protecting against the accidental deletion (or some other catastrophe) of a site's active configuration, backups, something else?</p>",
        "id": 196658834,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1588781825
    },
    {
        "content": "<p>...in GovCMS we used to have a lot of that happen, so we've made db backups (drush sql-dump) and config backups (drush cex) the first deployment step.</p>",
        "id": 196659900,
        "sender_full_name": "klonos",
        "timestamp": 1588782276
    },
    {
        "content": "<p>...it retains 5 most-recent versions.</p>",
        "id": 196659948,
        "sender_full_name": "klonos",
        "timestamp": 1588782298
    },
    {
        "content": "<p>With Backdrop you have to sync (export/import) as well. Otherwise things don't get triggered properly. But that doesn't really help with my original question which is about dealing with the staging directory</p>",
        "id": 196660228,
        "sender_full_name": "Herb",
        "timestamp": 1588782430
    }
]