[
    {
        "content": "<p>Who would you consider to be a mentor to you? Who's helped you on your Backdrop journey; be it learning to use Backdrop, write code, contribute to core, bug fix, problem solve, etc.? Let's name and thank those who've helped us.</p>",
        "id": 187238655,
        "sender_full_name": "BWPanda",
        "timestamp": 1580713327
    },
    {
        "content": "<p>For me, <span class=\"user-mention\" data-user-id=\"256583\">@Geoff St. Pierre (serundeputy)</span> has helped me a lot in learning Lando, Drush and <code>b</code>, among other things. I greatly appreciate his help and advice, and consider him to be one of my Backdrop mentors. Thank you Geoff!</p>",
        "id": 187238730,
        "sender_full_name": "BWPanda",
        "timestamp": 1580713444
    },
    {
        "content": "<p>I came to Backdrop through my relationship with @jenlampton and @quicksketch whom I have been fortunate enough to spend time with at many Drupal events and whom I frequently bug with requests for assistance and advice. I worked with @jenlampton on my very first Backdrop project and have learned a great deal from her about Drupal and Backdrop. One of my earliest memories of a Drupal event was a keynote at Twin Cities Drupal camp by @jenlampton (about 6-7 years ago). </p>\n<p><span class=\"user-mention\" data-user-id=\"256583\">@Geoff St. Pierre (serundeputy)</span> has also really helped me understand Backdrop and helped me get acquainted with the community. Thanks Geoff.</p>",
        "id": 187239569,
        "sender_full_name": "StPaulTim",
        "timestamp": 1580714689
    },
    {
        "content": "<p>I joined the Backdrop community in its first days after the fork was announced (amazing how 5 years have gone by!). That time happened to be a very difficult for me in my personal life (moving from Greece to Australia - having to become a long-distance husband and father to 2yo daughter etc.) ...I was trying to keep my sanity by keeping my mind busy with contributions to the community, and trying to delve deeper into webdev and Drupal/Backdrop ...it was really refreshing to join a community that had the \"old spark\" of the original Drupal community: welcoming novice developers (developer-wannabe's in my case), and not looking down on us for not embracing the new, cool D8 and all its symfony/composer fanciness.  I considered the \"founding members\" to be my friends (not just @jenlampton and <span class=\"user-mention\" data-user-id=\"258586\">@Nate Lampton</span>  - talking about the \"extended\" team of all the people that joined the community early on) ...everyone has been so helpful with all my questions, and they did not seem to mind that I was the \"issue-opening bot\" on GitHub <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> ...back in Drupal-land, I used to be that annoying person in the issue queue, that had all those ideas/suggestions, but most of them were being dismissed, which eventually lead me to be demotivated from contributing ...I couldn't code back then - I was just doing patch testing (no code reviews), brainstorming for solutions to UX/UI problems, providing screenshots/mockups, and helping newcomers \"orientate\" ...after a while, it was <span class=\"user-mention\" data-user-id=\"256583\">@Geoff St. Pierre (serundeputy)</span> who said to me \"You know that you can easily create a pull request by using the GitHub web interface. Right?\" ...he went on to show me how to do that, and the rest is history: a PR-creating monster has been created out of me <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> ...so a big thank you those that I call \"the usual gang\" - you know who you are guys and gals ...I really love y'all and consider you my friends <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 187462822,
        "sender_full_name": "klonos",
        "timestamp": 1580916238
    },
    {
        "content": "<p>@klonos I can't imagine being away from my 2yo daughter for so long. It must be so hard. I also joined during a really difficult time in my life. And it helped keep my mind busy too. It coincided with me finally getting my blog off of Drupal 6</p>",
        "id": 187464344,
        "sender_full_name": "Herb",
        "timestamp": 1580917232
    }
]