[
    {
        "content": "<p>We are looking for about 20 members of the community to participate in an experimental survey to help us set priorities for 2021.</p>\n<p><a href=\"http://survey.backdropcms.org/\">http://survey.backdropcms.org/</a></p>",
        "id": 223849416,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611541104
    },
    {
        "content": "<p>Anyone in the community can add issues or vote. But, you will be required to create an account.</p>",
        "id": 223849421,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611541126
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><br>\n It would be nice to have the vote count column sortable.</p>",
        "id": 223851752,
        "sender_full_name": "Laryn",
        "timestamp": 1611544740
    },
    {
        "content": "<p>Maybe it's a good thing there's no 'vote down' option, otherwise I might use it... <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 223851910,
        "sender_full_name": "BWPanda",
        "timestamp": 1611545020
    },
    {
        "content": "<blockquote>\n<p>It would be nice to have the vote count column sortable.</p>\n</blockquote>\n<p>It should be. Are you not able to sort by \"vote count\"?</p>",
        "id": 223856717,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611552223
    },
    {
        "content": "<p>Tiny bug report: \"Promote certain contrib projects in project browser. (3193)\" appears twice.</p>",
        "id": 223871875,
        "sender_full_name": "indigoxela",
        "timestamp": 1611566661
    },
    {
        "content": "<p>Opps</p>",
        "id": 223871891,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611566676
    },
    {
        "content": "<p>Duplicate has been removed.</p>",
        "id": 223871989,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611566748
    },
    {
        "content": "<p>7 Participants, so far.... </p>\n<p>Thanks everyone. We'll talk about how this is working during call next week.</p>",
        "id": 223892794,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611579585
    },
    {
        "content": "<p>Feedback welcome here any time.</p>",
        "id": 223892879,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611579606
    },
    {
        "content": "<blockquote>\n<p>Are you not able to sort by \"vote count\"?</p>\n</blockquote>\n<p>No, it's not sortable for me.</p>",
        "id": 223894159,
        "sender_full_name": "Laryn",
        "timestamp": 1611580281
    },
    {
        "content": "<p>Good idea, this survey, thank you <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> I hope that \"better search\" gets hundreds of votes;-)</p>",
        "id": 223933068,
        "sender_full_name": "mazze.ch",
        "timestamp": 1611596322
    },
    {
        "content": "<p>So, by posting this here, it means that a majority of the 20 members will be developers, and therefore, mostly features a developer would want will be voted up?</p>",
        "id": 223938334,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1611598707
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256627\">@oadaeh (Jason Flatt)</span> - It means that this is a survey of people that are actively involved in the community. Much the way that decisions made during development meetings are inherently skewed towards the opinions of those who show up at meetings. In my view, it's important that we do keep that in mind and never suggest that the results of this survey are anything more than a snapshot of the opinions of those who in Zulip. </p>\n<p>I would love to do a broader survey of the community with much greater outreach to end users. I view this survey as a first step in that direction. I see this as an experiment leading towards a much more representative survey in the future. </p>\n<blockquote>\n<p>mostly features a developer would want will be voted up?</p>\n</blockquote>\n<p>This may be true, but I would not assume it. Many of our most active members in the community do not consider themselves developers and some of the developers are very vocal in their advocacy for issues that are most needed by end users. I've recently heard the suggestion that core development may be skewed against the needs of developers, so personally I'm not overly concerned about this becoming too developer centric or at least any more skewed towards developers than our existing tools are. </p>\n<p>Certainly, the results of this survey should not be portrayed as anything more than a experimental snapshot of the opinions of those most active in the Zulip portion of the community - leading towards better and more representative surveys in the future.</p>",
        "id": 223950717,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604383
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> The 1.18 release newsletter goes out this week. Is the survey something you think can/should be mentioned there, to get opinions of a slightly different subset of the community...?</p>",
        "id": 223951310,
        "sender_full_name": "BWPanda",
        "timestamp": 1611604575
    },
    {
        "content": "<p>I would say that yes, it should be in the newsletter, with a note that this is something new we are trying out.</p>",
        "id": 223951687,
        "sender_full_name": "klonos",
        "timestamp": 1611604726
    },
    {
        "content": "<p>I am open to doing making this survey much more public, but my fear is that will require much more work. Issues are not well defined or described in his survey and I don't have the time to polish the titles and descriptions. My fear, is that if we widely publicize the existing survey we'll get lots of criticism for not making it much easier to use. </p>\n<p>In my view, the current state of the survey is good for folks who are active in the community and understand how to use github, but that it would be confusing to a user that is uncomfortable with github.</p>",
        "id": 223951757,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604751
    },
    {
        "content": "<p>And I think making the survey more public will require putting the site on SSL.</p>",
        "id": 223951966,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1611604835
    },
    {
        "content": "<p>But, if there is consensus that the survey in it's existing form would be usable to our newsletter audience, I don't object. I just anticipate that as soon as that decision is made, I'm going to get lots of usability feedback that I don't have time to process right now.</p>",
        "id": 223951976,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604837
    },
    {
        "content": "<p>SSL is coming. And would be a requirement for a more public survey.</p>",
        "id": 223952014,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604852
    },
    {
        "content": "<p>Again, I view this current survey mostly as an experiment.</p>",
        "id": 223952028,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604863
    },
    {
        "content": "<p>But, if other folks think that this experiment is ready for prime time. I'm listening.</p>",
        "id": 223952064,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604881
    },
    {
        "content": "<p>Personally, I would put a lot more effort into the survey, before I would feel comfortable putting out in the newsletter and on Twitter. But, again - I'm open to other ideas.</p>",
        "id": 223952231,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611604942
    },
    {
        "content": "<p>I think put it in that newsletter (to allow people to vote and test it out) + explain that it is something we are experimenting with. Then perhaps also add a forum post for feedback.</p>",
        "id": 223952236,
        "sender_full_name": "klonos",
        "timestamp": 1611604945
    },
    {
        "content": "<p>...the feedback would be mainly to help us improve this tool, rather than propose more things to vote on.</p>",
        "id": 223952322,
        "sender_full_name": "klonos",
        "timestamp": 1611604986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> - If there is consensus that is it worthwhile making this MORE public in its existing format. then I'm not against that. </p>\n<p>I just fear that if we make the current survey public, we're going to get lots of negative feedback on it's usability. Not feedback in the form of here are nice ideas about how to make it better next time, but feedback that sounds like - how could you put such a experimental survey out in the public.</p>",
        "id": 223952556,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611605073
    },
    {
        "content": "<p>The current site was designed with the idea that it would not be getting a wide audience and did not need all the bells and whistles that large public survey would need. </p>\n<p>This site was designed with the idea that it was a small experiment that might eventually lead towards that larger survey in the future.</p>",
        "id": 223952806,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611605175
    },
    {
        "content": "<p>I thought that this was in order to provide something similar to the voting/petitions system that ClassicPress uses as well (we've discussed this in the past). ...perfect is the enemy of getting things done, and I don't see any harm in putting an \"early alpha\" of this tool as it gets shape <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 223953003,
        "sender_full_name": "klonos",
        "timestamp": 1611605282
    },
    {
        "content": "<p>It's intention was that it MIGHT become that. I'm not sure if that ClassicPress idea is a good idea yet. I view this as a small experiment to try that idea out, before making any commitment.</p>",
        "id": 223953140,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611605370
    },
    {
        "content": "<blockquote>\n<p>...how could you put such a experimental survey out in the public.</p>\n</blockquote>\n<p>If we make it clear that this is experimental, and that we are simply trying out an idea we had, I don't think that we'd be upsetting anybody.</p>",
        "id": 223953254,
        "sender_full_name": "klonos",
        "timestamp": 1611605419
    },
    {
        "content": "<p>Well let's see, I'm going to step back and listen. If there is consensus that making this current survey widely public is acceptable. I'm fine with that. </p>\n<p>If making it widely public somes with a list of 20 new features and improvements, then I will turn the site over to someone else to make those improvements. I don't have time right now.</p>",
        "id": 223953398,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611605510
    },
    {
        "content": "<p>I'm happy to have gotten the process going. If anyone wants to take it further, I'm totally happy with that.</p>",
        "id": 223953506,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611605551
    },
    {
        "content": "<p>This is open-source <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> ...things we are working on are meant to be fun/rewarding for us, and useful to others. I don't think that anyone using open source software out there has strict expectations re delivery and perfection, and I wouldn't expect them to come back with negative comments about any work we are doing for the benefit of the community. Furthermore, if this site gets its own repo in GitHub, no single person would need to be the sole person working on tweaking/improving things on their own, ...we are renowned for helping each other out <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 223954261,
        "sender_full_name": "klonos",
        "timestamp": 1611605986
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"256729\">@klonos</span>.</p>",
        "id": 223956203,
        "sender_full_name": "BWPanda",
        "timestamp": 1611606980
    },
    {
        "content": "<p>Here's my initial wording attempt for the newsletter:</p>\n<blockquote>\n<p>As we start to plan for the next few releases of Backdrop CMS in 2021, we're looking for ideas of what the community would most like to see worked on and added to Backdrop. As an experiment, we've setup a survey where you can add feature ideas, then vote on the ones you're most excited about. To participate, and for more information about the survey, visit: <a href=\"http://survey.backdropcms.org\">http://survey.backdropcms.org</a></p>\n</blockquote>",
        "id": 223966166,
        "sender_full_name": "BWPanda",
        "timestamp": 1611611717
    },
    {
        "content": "<p>FYI - 10 People have completed the survey so far. Half of the minimum goal that we set. Still listening for additional input on whether or not we should share the survey (as-is) with broader community via social media and/or newsletter.</p>",
        "id": 223979520,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611618587
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> </p>\n<p>I know you're feeling a bit of a crunch <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> but I think as it sits, it is fine. I doubt many people will criticize it (if any) and as long as there's a disclaimer that it's a WIP, people will understand.</p>\n<p>I think folks will be excited about having a chance to get their voice heard without being vocal.</p>",
        "id": 223998094,
        "sender_full_name": "Phil Ward",
        "timestamp": 1611637709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> let's send it out via social media soon, and if we don't get the numbers we want we can edit it into the newsletter on Friday</p>",
        "id": 223998840,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638643
    },
    {
        "content": "<p>(\\<em>cough\\</em> it's already edited into the newsletter <span aria-label=\"smiling face\" class=\"emoji emoji-263a\" role=\"img\" title=\"smiling face\">:smiling_face:</span> - I'll just remove it before I send if we don't want it in there by then)</p>",
        "id": 223998886,
        "sender_full_name": "BWPanda",
        "timestamp": 1611638718
    },
    {
        "content": "<p>though, I'd personally prefer we move it onto the forum before it goes out in something like the newsletter</p>",
        "id": 223998889,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638726
    },
    {
        "content": "<p>but I'm not sure that will get done by friday</p>",
        "id": 223998891,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638731
    },
    {
        "content": "<p>oh, well. I'm late to the party :)</p>",
        "id": 223998902,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span> See suggested wording above</p>",
        "id": 223998948,
        "sender_full_name": "BWPanda",
        "timestamp": 1611638777
    },
    {
        "content": "<p>that's perfect, the \"As an experiment\" sets the right expectations :)</p>",
        "id": 223998969,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span>  this is what you get for building another fantastic tool...  everyone wants to share it!</p>",
        "id": 223998990,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638858
    },
    {
        "content": "<p>I'm so happy you are helping with the newsletter <span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> :)</p>",
        "id": 223999014,
        "sender_full_name": "jenlampton",
        "timestamp": 1611638882
    },
    {
        "content": "<p>I'll Tweet about it tomorrow. Hopefullly, SSL will be working by then. Actually, I won't tweet unless it is.</p>",
        "id": 223999537,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611639492
    },
    {
        "content": "<p>Didn't get a chance to fix SSL last night, so did not Tweet yet. Should get that taken care of tonight. </p>\n<p>So far, 12 users have expressed a preference for 35 different issues.</p>",
        "id": 224135600,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611717477
    },
    {
        "content": "<p>SSL is working. I removed the work \"Vote\" from the survey, because really it's more of a preference poll than a vote. </p>\n<p><a href=\"https://survey.backdropcms.org/\">https://survey.backdropcms.org/</a></p>",
        "id": 224279191,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611802853
    },
    {
        "content": "<p>When trying to register an account, I failed because the sending mail server (<a href=\"http://wrqvzxfw.outbound-mail.sendgrid.net\">wrqvzxfw.outbound-mail.sendgrid.net</a>) is blacklisted. <span aria-label=\"disappointed\" class=\"emoji emoji-1f61e\" role=\"img\" title=\"disappointed\">:disappointed:</span></p>",
        "id": 224307471,
        "sender_full_name": "indigoxela",
        "timestamp": 1611829353
    },
    {
        "content": "<p>The blacklists, that server is on:</p>\n<ul>\n<li>BARRACUDA</li>\n<li>RATS Spam</li>\n<li>UCEPROTECTL3</li>\n</ul>\n<p>(sigh... sendgrid)</p>",
        "id": 224307619,
        "sender_full_name": "indigoxela",
        "timestamp": 1611829458
    },
    {
        "content": "<p>How did you know why the mail failed if you didn't get the mail?</p>",
        "id": 224434204,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611900563
    },
    {
        "content": "<blockquote>\n<p>How did you know why the mail failed if you didn't get the mail?</p>\n</blockquote>\n<p>I'm a freak, I run my own mailserver. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> Anyway, mission accomplished (with some help from <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span>)</p>\n<p>I added three more suggestions to the feature survey list:</p>\n<ul>\n<li>More commonly used date formats</li>\n<li>VBO entity value actions</li>\n<li>Upgrade UI module</li>\n</ul>\n<p>I like this survey approach, BTW. This looks like something we could re-use. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 224437868,
        "sender_full_name": "indigoxela",
        "timestamp": 1611905006
    },
    {
        "content": "<p>The caching on <a href=\"http://survey.backdropcms.org\">survey.backdropcms.org</a> seems a bit aggressive, though. Might take some time until they show up for anonymous.</p>",
        "id": 224437987,
        "sender_full_name": "indigoxela",
        "timestamp": 1611905132
    },
    {
        "content": "<p>I turned off caching for anonymous users. I don't think we really need it.</p>",
        "id": 224438574,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611905715
    },
    {
        "content": "<p>A useful survey. Thanks <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span>  I will provide my input when I'm able to log in.</p>",
        "id": 224485524,
        "sender_full_name": "Herb",
        "timestamp": 1611933821
    },
    {
        "content": "<p>The one thing hard to capture in such a survey is the relative effort. We could rank them by effort (doesn't need to have units) so we have some sense of what is easy or hard.</p>",
        "id": 224485801,
        "sender_full_name": "Herb",
        "timestamp": 1611933917
    },
    {
        "content": "<p>For example, I saw one of my PRs on the list which has been just waiting on testing/review since last fall. I forgot about it but I think it's basically done.</p>",
        "id": 224485972,
        "sender_full_name": "Herb",
        "timestamp": 1611933972
    },
    {
        "content": "<p>But at same time, things like Backup an Migrate in core are hard.</p>",
        "id": 224486044,
        "sender_full_name": "Herb",
        "timestamp": 1611934009
    },
    {
        "content": "<p>But worthy</p>",
        "id": 224486075,
        "sender_full_name": "Herb",
        "timestamp": 1611934020
    },
    {
        "content": "<blockquote>\n<p>The one thing hard to capture in such a survey is the relative effort. We could rank them by effort</p>\n</blockquote>\n<p>Maybe the effort isn't that relevant yet, when asking people for (personal) preferences. The survey's probably more about figuring out the most desired / needed / wanted things from a user perspective. At least, that's how I interpret it - maybe I'm wrong <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 224487578,
        "sender_full_name": "indigoxela",
        "timestamp": 1611934527
    },
    {
        "content": "<p>The ranking could happen afterwards. I think it would be useful in deciding what actually ends up on a short list.</p>",
        "id": 224489780,
        "sender_full_name": "Herb",
        "timestamp": 1611935359
    },
    {
        "content": "<blockquote>\n<p>I think it would be useful in deciding what actually ends up on a short list.</p>\n</blockquote>\n<p>Not sure. Considering my own (sort of anarchist) approach to either do what I currently need/want most, or do what seems like being most exciting to implement... I wouldn't do anything quicker in an Open Source project, just because it's not much work - but maybe that's just me. <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n<p>What the ranking by user desire <em>could</em> do is that someone picks up a task, because more people than expected seem to need it, and it was on a todo-list anyway, but further down.</p>",
        "id": 224493409,
        "sender_full_name": "indigoxela",
        "timestamp": 1611936413
    },
    {
        "content": "<p>If we just took an anarchist approach we wouldn't need the survey at all, no?</p>",
        "id": 224495465,
        "sender_full_name": "Herb",
        "timestamp": 1611937145
    },
    {
        "content": "<p>A ranking of effort also provides information that can help someone choose what they want to work on</p>",
        "id": 224495540,
        "sender_full_name": "Herb",
        "timestamp": 1611937181
    },
    {
        "content": "<blockquote>\n<p>If we just took an anarchist approach we wouldn't need the survey at all, no?</p>\n</blockquote>\n<p>That's true <span aria-label=\"smiling face\" class=\"emoji emoji-263a\" role=\"img\" title=\"smiling face\">:smiling_face:</span></p>",
        "id": 224496064,
        "sender_full_name": "indigoxela",
        "timestamp": 1611937397
    },
    {
        "content": "<blockquote>\n<p>The one thing hard to capture in such a survey is the relative effort. We could rank them by effort (doesn't need to have units) so we have some sense of what is easy or hard.</p>\n</blockquote>\n<p>I agree with <span class=\"user-mention\" data-user-id=\"256705\">@Herb</span> that some attempt to categorize how difficult each issue is would be helpful. I agree with <span class=\"user-mention\" data-user-id=\"256738\">@indigoxela</span> that given the nature of an open source project, it's value is limited. </p>\n<p>Most of my concerns around this version of the survey is how quickly (and somewhat sloppy) the list is. For the broader Backdrop user base, I think we need to provide better titles, descriptions, and more context around each issue. These are things to think about prior to version 2 of this survey.</p>\n<p>I think some broad sense of how difficult an issue is might inform some users selections in that if they know an issue is very difficult, they might prioritize one that is easier instead.</p>",
        "id": 224532084,
        "sender_full_name": "StPaulTim",
        "timestamp": 1611953778
    },
    {
        "content": "<blockquote>\n<p>Most of my concerns around this version of the survey is how quickly (and somewhat sloppy) the list is.</p>\n</blockquote>\n<p>I see version 1 of the survey as a proof of concept, and I think, it's a cool idea, worth to further elaborate. Sloppy? Possibly, but a great starting point. Many thanks <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> to get this going.</p>\n<blockquote>\n<p>some attempt to categorize how difficult each issue is would be helpful</p>\n</blockquote>\n<p>Time estimation isn't easy, though. Thinking of all the times I was totally wrong with my own estimations - in Open Source projects as well as other ones.</p>",
        "id": 224574937,
        "sender_full_name": "indigoxela",
        "timestamp": 1611997870
    },
    {
        "content": "<p>I specifically <em>avoided</em> calling it time estimation. We're much better at doing relative size</p>",
        "id": 224580912,
        "sender_full_name": "Herb",
        "timestamp": 1612006218
    },
    {
        "content": "<p>A think that a do is assign T-shirt sizes: XS, S, M, L, XL</p>",
        "id": 224580949,
        "sender_full_name": "Herb",
        "timestamp": 1612006315
    },
    {
        "content": "<p>Yes, this!</p>",
        "id": 224598755,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612032297
    },
    {
        "content": "<blockquote>\n<p>I specifically <em>avoided</em> calling it time estimation. We're much better at doing relative size</p>\n</blockquote>\n<p>Agreed. This was my intention, I was just less careful in my word choice.</p>",
        "id": 224601739,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612036035
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> ...is there a GitHub repo for this site? ...I can't see anything under <a href=\"https://github.com/backdrop-ops\">https://github.com/backdrop-ops</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=280&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops\" title=\"Backdrop Ops\">Backdrop Ops</a></div><div class=\"message_embed_description\">Operations for Backdrop CMS. Backdrop Ops has 26 repositories available. Follow their code on GitHub.</div></div></div>",
        "id": 224861709,
        "sender_full_name": "klonos",
        "timestamp": 1612267386
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> - No, I whipped this up pretty quickly using Simplo as a proof of concept. This is still on my own infrastructure. If we want to keep this, we'll need to decide if it is a stand alone site on <a href=\"http://B.org\">B.org</a> infrastructure or if we will incorporate the features in the Forum (which has been suggested).</p>",
        "id": 224925637,
        "sender_full_name": "StPaulTim",
        "timestamp": 1612295203
    },
    {
        "content": "<p>Thanks for clarifying <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> ...it can stay in your repo/infrastructure while we flesh out features/design etc. and can move it when ready. Just thought that it'd be easier to have a public GitHub repo where we report issues, instead of here.</p>",
        "id": 224927866,
        "sender_full_name": "klonos",
        "timestamp": 1612296075
    }
]