[
    {
        "content": "<p>Anyone interested in paid work for porting modules to Backdrop? Or any recommendation of a service who does that? I have several projects where I need a working version of a D7 module in Backdrop in the months to come, and just wanted to ask here first... Although my projets are below the \"five figures area\", the goal is to make the customer pay a part of the module ports.</p>",
        "id": 193750081,
        "sender_full_name": "mazze.ch",
        "timestamp": 1586761957
    },
    {
        "content": "<p>Do you have a list of those to-be-ported modules <span class=\"user-mention\" data-user-id=\"269428\">@mazze.ch</span> ? ...are they custom or contrib?</p>",
        "id": 193750414,
        "sender_full_name": "klonos",
        "timestamp": 1586762536
    },
    {
        "content": "<p>I personally am more interested to contribute in porting those modules, and then have the customer donate a specific amount to Backdrop.</p>",
        "id": 193750435,
        "sender_full_name": "klonos",
        "timestamp": 1586762602
    },
    {
        "content": "<p>(i.e. I don't want any money for myself)</p>",
        "id": 193750442,
        "sender_full_name": "klonos",
        "timestamp": 1586762629
    },
    {
        "content": "<p>Hi @klonos they are all contrib, some of them have Backdrop versions, but not working properly, e.g. Node Clone. Others are Geocoding, Filter by Month in Views, Entity Registration, Search API. Right now, Entity Registration would be the most urgent one, <span class=\"user-mention\" data-user-id=\"256757\">@docwilmot</span> already started working on the port, but he's also very active in core development, which is at least as important... but in some customer projects, the short-term priorities are different, as you all know;-)</p>",
        "id": 193750837,
        "sender_full_name": "mazze.ch",
        "timestamp": 1586763155
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"269428\">@mazze.ch</span> My dad and I are still looking for work. I don't want to step on anyone's toes if they are willing to donate the time, but I would prefer to work on Backdrop instead of D8 if that is an option.</p>",
        "id": 193793146,
        "sender_full_name": "Joseph Flatt",
        "timestamp": 1586797061
    },
    {
        "content": "<p>All good ...the \"don't want money\" statement comes along with \"but I cannot dedicate full time\" <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 193799949,
        "sender_full_name": "klonos",
        "timestamp": 1586800475
    }
]