[
    {
        "content": "<p>The <a href=\"https://backdropcms.org/leadership\">https://backdropcms.org/leadership</a> page lists  Jack Aponte, Tim Erickson, Olaf Grabienski, Jen Lampton, Greg Netsas and Andy Shillingford. And any late comers like myself will quickly start recognizing them thanks to their active participation in community discussions on github, zulipchat, forums or regular video-meetings. Especially it's easy to recognize those PMC members who use their real names everywhere. I had to search on Andy Shillingford to find out he is, in fact, <code>docwilmot</code> - that username I recognize.</p>\n<p>Now, the only person in PMC whom I could not find in any kind of discussions is Jack Aponte. And I wonder how Jack relates to Backdrop and Backdrop community. I've missed lot's of things, especially from times when Backdrop was just taking off. So probably Jack played some role back then. Could someone please enlighten me about Jack's place and role in Bakcdrop community?</p>",
        "id": 226622391,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613547587
    },
    {
        "content": "<blockquote>\n<p>Could someone please enlighten me about Jack's place and role in Bakcdrop community?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"262176\">@Jack</span> mind to chime in and drop a message? <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 226622528,
        "sender_full_name": "indigoxela",
        "timestamp": 1613547716
    },
    {
        "content": "<p>Maybe we need to add small bios for PMC members, and certainly their GitHub usernames.</p>",
        "id": 226622653,
        "sender_full_name": "BWPanda",
        "timestamp": 1613547829
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256607\">BWPanda</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226622653\">said</a>:</p>\n<blockquote>\n<p>Maybe we need to add small bios for PMC members, and certainly their GitHub usernames.</p>\n</blockquote>\n<p>Would be really nice. Especially for new users</p>",
        "id": 226622782,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613547952
    },
    {
        "content": "<p>Jack's Github account is <a href=\"https://github.com/jackaponte\">https://github.com/jackaponte</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/jackaponte\" style=\"background-image: url(https://avatars.githubusercontent.com/u/593569?s=400&amp;u=b9175aa86ce040f3402c94fab354676ec4c30527&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/jackaponte\" title=\"jackaponte - Overview\">jackaponte - Overview</a></div><div class=\"message_embed_description\">jackaponte has 19 repositories available. Follow their code on GitHub.</div></div></div>",
        "id": 226640953,
        "sender_full_name": "Olaf Grabienski",
        "timestamp": 1613559696
    },
    {
        "content": "<p><a href=\"https://palantetech.coop/about\">https://palantetech.coop/about</a> has a short bio/info block on Jack <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://palantetech.coop/about\" style=\"background-image: url(https://palantetech.coop/files/styles/large/public/field/image/palante_winter_2020_retreat.jpg)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://palantetech.coop/about\" title=\"About Us\">About Us</a></div><div class=\"message_embed_description\">Palante Tech Coop provides technology services to progressive nonprofits. Learn more about our coop and our workers!</div></div></div>",
        "id": 226661437,
        "sender_full_name": "klonos",
        "timestamp": 1613571308
    },
    {
        "content": "<p>beautiful Backdrop website:-)</p>",
        "id": 226661751,
        "sender_full_name": "mazze.ch",
        "timestamp": 1613571460
    },
    {
        "content": "<p>Indeed! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 226661786,
        "sender_full_name": "klonos",
        "timestamp": 1613571473
    },
    {
        "content": "<p>Thanks for the inks. I had searched and read on Jack. I know he is a nice person and has one commit to core <a href=\"https://github.com/backdrop/backdrop/commits?author=jackaponte\">https://github.com/backdrop/backdrop/commits?author=jackaponte</a>. But since Jack is not so noticeably active in the community, I thought he's done some important contribution we don't know that he is in PMC. Nothing against Jack, I'm just wondering how exactly people are elected to PMC. Trying to fully grasp how Backdrop CMS project and the community around it is designed, I'm more interested in the processes and procedures than in persons.</p>\n<p>We have only two lines on <a href=\"https://backdropcms.org/leadership\">https://backdropcms.org/leadership</a> regarding how people are elected to PMC:</p>\n<blockquote>\n<p>Additional individuals may be added to the committee by a unanimous vote by the PMC. Any current PMC member can nominate potential new members. </p>\n</blockquote>\n<p>Sounds like closed club of persons who nominate and elect themselves. Again, I don't mean persons, but the process itself. Is it ideal? Doesn't the wider community has its saying on PMC? I understand that the wider community of Backdrop is not yet firmly formed, occasional people can came and go, and there is still no voting system, no specific principles and tools on how to reach real consensus and not only just by submitting bunch of contradicting opinions, and that at this stage to keep everything stable maybe the wider community should not have it's saying on PMC. However, down the road I don't think people will like that PMC is a closed club of small group of people, some of them with a single commit to core and unknown role in the project.</p>\n<p>I really don't want to undermine anyone's role (especially when unknown to me or publicly), however I really would like Backdrop to avoid mistakes done by other projects, to thrive and prosper, and it order to be successful we need clear and fully transparent procedures.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop/backdrop/commits?author=jackaponte\" style=\"background-image: url(https://avatars.githubusercontent.com/u/5283039?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop/backdrop/commits?author=jackaponte\" title=\"backdrop/backdrop\">backdrop/backdrop</a></div><div class=\"message_embed_description\">Backdrop core code repository. Contribute to backdrop/backdrop development by creating an account on GitHub.</div></div></div>",
        "id": 226694823,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613583467
    },
    {
        "content": "<p>I leave your question about how PMC members are nominated/elected as an open question but I think your premise seems to be that PMC members should be the people with the most (or at least very many) core commits -- which is not the goal at all. From the same page you linked:</p>\n<blockquote>\n<p>The individuals that make up this committee can be, but are not necessarily, core committers. The PMC should reflect all perspectives from within the Backdrop community ... The PMC should also aim to be inclusive of people with different levels of technical experience, geographies, languages spoken, races, and genders.</p>\n</blockquote>\n<p>To your question about how to know PMC members place and role, I think it would be good to list the perspective/constituency they are bringing to the role. The leadership page lists \"core developers, back-end developers, front-end developers, site-builders, people familiar with the business of website development, people focused on user-experience, and others as identified by the community\" as a starting point. Personally I'd love to make sure that nonprofits and educational groups were represented, which I happen to know is part of what Jack brings.</p>\n<p>(Also you may not be aware if you haven't happened across the announcement but Jack has been on personal sabbatical until recently which has rightly meant their name has shown up less often here.)</p>",
        "id": 226698333,
        "sender_full_name": "Laryn",
        "timestamp": 1613584848
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256573\">Laryn</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226698333\">said</a>:</p>\n<blockquote>\n<p>I leave your question about how PMC members are nominated/elected as an open question but I think your premise seems to be that PMC members should be the people with the most (or at least very many) core commits -- which is not the goal at all. </p>\n</blockquote>\n<p>Not at all. I think the community needs to know each PMC member well and recognize who are they, how they are tied to the project and what are their contributions, which are measured not necessarily by number of commits to core. I've looked at Jack's commits only because I couldn't derive any other strong ties to Backdrop.</p>\n<p>And again I suggest to abstract away from specific names or persons. What should we all interested in is to get rules, principles, policies straighten, clear, transparent and easily understandable and acceptable by most if not all community members. I don't like any grey territory</p>",
        "id": 226699353,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613585263
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256573\">Laryn</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226698333\">said</a>:</p>\n<blockquote>\n<p>Personally I'd love to make sure that nonprofits and educational groups were represented, which I happen to know is part of what Jack brings.</p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> I'm also all for nonprofit and educational groups to be presented.</p>\n<blockquote>\n<p>(Also you may not be aware if you haven't happened across the announcement but Jack has been on personal sabbatical until recently which has rightly meant their name has shown up less often here.)</p>\n</blockquote>\n<p>That I didn't know. But again abstracting away from Jack's person, it's not clear has (will be in the future) the wider community it's saying on PMC, or it will be always self-chosen and self-elected group of people?</p>",
        "id": 226699985,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613585519
    },
    {
        "content": "<p>I am sorry I took example of Jack to raise some questions. And once again I call to abstract away from specific persons and discuss what is in the best interest of the project and community. IS the current way of electing PMC ideal?</p>",
        "id": 226700247,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613585626
    },
    {
        "content": "<p>Wow, this is quite a thread! I'm not entirely sure how to respond. I was on sabbatical and away from work from August through December 2020 so that's likely why you saw so little of me, <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span>, though I remember seeing you join the community! :)</p>",
        "id": 226706163,
        "sender_full_name": "jackaponte",
        "timestamp": 1613587843
    },
    {
        "content": "<p>I was asked to join the PMC years ago as a representative of both the business sector (my shop builds Backdrop websites) and the nonprofit audience (I've worked exclusively with nonprofits for over a decade and specialize in nonprofit web builds.) I've been a Backdrop evangelist for most of this time; have participated in and presented at a number of Backdrop summits, and used to attend meetings as often as I could; actually planning to start attending again now.</p>",
        "id": 226706452,
        "sender_full_name": "jackaponte",
        "timestamp": 1613587952
    },
    {
        "content": "<p>Also, my pronouns are they and them, not he.</p>",
        "id": 226706525,
        "sender_full_name": "jackaponte",
        "timestamp": 1613587987
    },
    {
        "content": "<p>I hope that answers all of your questions specifically about me, Alan; I'd support continuing this conversation in a more broad sense about how the PMC works, but hope that it does not continue to directly focus on me and whether or not I have specifically earned my place on the PMC. Not a fun position to be put in, especially as one of the few visibly queer, trans people of color in the Backdrop community!</p>",
        "id": 226706772,
        "sender_full_name": "jackaponte",
        "timestamp": 1613588087
    },
    {
        "content": "<p>Also, I see that at the end you apologize for focusing on me specifically and say that you wish to shift the focus to a more general conversation about how people are selected to the PMC. That's good, but given the lengthy focus on me, specifically, I think my longer response was still necessary.</p>",
        "id": 226709103,
        "sender_full_name": "jackaponte",
        "timestamp": 1613588921
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"262176\">@Jack</span> your response looks good to me. I was going to also mention the pronouns.</p>",
        "id": 226709542,
        "sender_full_name": "Herb",
        "timestamp": 1613589069
    },
    {
        "content": "<p>... but then saw that you beat me to it</p>",
        "id": 226709616,
        "sender_full_name": "Herb",
        "timestamp": 1613589090
    },
    {
        "content": "<p>It's good to have the PMC members not match directly with core contributors or contrib maintainers. But <span class=\"user-mention\" data-user-id=\"262176\">@Jack</span> said it better</p>",
        "id": 226709974,
        "sender_full_name": "Herb",
        "timestamp": 1613589226
    },
    {
        "content": "<p>And <span class=\"user-mention\" data-user-id=\"256573\">@Laryn</span> said it better. Ok, I'll just get back to pushing buttons</p>",
        "id": 226710241,
        "sender_full_name": "Herb",
        "timestamp": 1613589327
    },
    {
        "content": "<blockquote>\n<p>Also, I see that at the end you apologize for focusing on me specifically and say that you wish to shift the focus to a more general conversation about how people are selected to the PMC. That's good, but given the lengthy focus on me, specifically, I think my longer response was still necessary.</p>\n</blockquote>\n<p>Jack, thanks for taking this with understanding. I asked about you only out of curiosity of newer user who came at unfortunate time when you went sabbatical and who started to recognize well everybody in PMC, but missed your presence. Nothing personal indeed.</p>",
        "id": 226715511,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613591589
    },
    {
        "content": "<p>Unfortunately, this discussion is taking different course than I was hoping it would. So I'm just quoting myself again in hope someone will try to elaborate on the real substance:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"258960\">Alan Mels</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226694823\">said</a>:</p>\n<blockquote>\n<p>... I'm just wondering how exactly people are elected to PMC. Trying to fully grasp how Backdrop CMS project and the community around it is designed, I'm more interested in the processes and procedures than in persons.</p>\n<p>We have only two lines on <a href=\"https://backdropcms.org/leadership\">https://backdropcms.org/leadership</a> regarding how people are elected to PMC:</p>\n<blockquote>\n<p>Additional individuals may be added to the committee by a unanimous vote by the PMC. Any current PMC member can nominate potential new members. </p>\n</blockquote>\n<p>Sounds like closed club of persons who nominate and elect themselves. Again, I don't mean persons, but the process itself. Is it ideal? Doesn't the wider community has its saying on PMC? I understand that the wider community of Backdrop is not yet firmly formed, occasional people can came and go, and there is still no voting system, no specific principles and tools on how to reach real consensus and not only just by submitting bunch of contradicting opinions, and that at this stage to keep everything stable maybe the wider community should not have it's saying on PMC. However, down the road I don't think people will like that PMC is a closed club of small group of people, some of them with a single commit to core and unknown role in the project.</p>\n<p>I really don't want to undermine anyone's role (especially when unknown to me or publicly), however I really would like Backdrop to avoid mistakes done by other projects, to thrive and prosper, and it order to be successful we need clear and fully transparent procedures.</p>\n</blockquote>",
        "id": 226715923,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613591760
    },
    {
        "content": "<p>I see <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> point here. Seems there are two things that need addressing:</p>\n<ol>\n<li>Update the Leadership page with more info about PMC members (GitHub usernames, the community 'perspective' they represent, short bio listing their contributions, reason(s) for being elected, etc.)</li>\n<li>Discuss whether the current system of PMC members electing themselves is one the community wants to continue to use. Possible alternatives/ideas to consider could be: PMC members serve a maximum of 2 years before needing to be elected/voted in again (currently it seems there's a minimum service of 2 years, but no maximum), PMC members are nominated and/or voted in by the wider Backdrop community.</li>\n</ol>",
        "id": 226719806,
        "sender_full_name": "BWPanda",
        "timestamp": 1613593523
    },
    {
        "content": "<blockquote>\n<p>Discuss whether the current system of PMC members electing themselves is one the community wants to continue to use.</p>\n</blockquote>\n<p>Ironically, if the community decided to change this, it'd likely be considered a policy change, and so the current PMC would first have to vote/agree to it...</p>",
        "id": 226729331,
        "sender_full_name": "BWPanda",
        "timestamp": 1613597625
    },
    {
        "content": "<p>I agree with number one: more info about the PMC members. But not number 2 (at least not in the near future). It's not unusual for boards to be organized this way, especially when small. And in this case it helps to ensure diversity by deliberately choosing from certain stakeholders.</p>",
        "id": 226730424,
        "sender_full_name": "Herb",
        "timestamp": 1613598167
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256705\">Herb</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226730424\">said</a>:</p>\n<blockquote>\n<p>I agree with number one: more info about the PMC members. But not number 2 (at least not in the near future). It's not unusual for boards to be organized this way, especially when small. And in this case it helps to ensure diversity by deliberately choosing from certain stakeholders.</p>\n</blockquote>\n<p>Fair enough, I'd be happy already with changes for (1), 'cause it would save other users from asking similar questions. </p>\n<p>As for (2), not to argue, but just to elaborate on this further: No doubt the current PMC members have been making the \"deliberate choices\" correctly so far. It's not about them at all, but rules and principles. I thought it's better to do proper ground works now in the very beginning, because fair and transparent rules could potentially attract more contributors. People are so different - some developer with broken heart with how interests of Acquia and Drupal Association got intertwined, could just notice those two sentences:</p>\n<blockquote>\n<p>Additional individuals may be added to the committee by a unanimous vote by the PMC. Any current PMC member can nominate potential new members. </p>\n</blockquote>\n<p>and decide to stay away and not to step on the same rakes twice. </p>\n<p>Being discreet, opening up to to the wider community and embracing common decision-making procedures only would empower Backdrop. Letting the wider community at least nominate candidates within set quotas for \"certain stakeholders\" is quite feasible even at this early stage.</p>",
        "id": 226741697,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613603157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> it's not uncommon for boards to select other board members. I think it's a good procedure for some organizations. I was part of an organization that did this for the first few years</p>",
        "id": 226745609,
        "sender_full_name": "Herb",
        "timestamp": 1613605680
    },
    {
        "content": "<p>A couple of the key things I personally keep in mind when either nominating or voting for new PMC members:</p>\n<ul>\n<li>People of seemingly good ethos, kind and respectful to others, and with a tendency to be helpful by nature (shown by their activity in the community - code, documentation, or other forms of contribution)</li>\n<li>Don't want the PMC to be mainly white English-speaking (as main language) male people from the US, as used to be the case back in the early days</li>\n</ul>",
        "id": 226745906,
        "sender_full_name": "klonos",
        "timestamp": 1613605848
    },
    {
        "content": "<p>...I'd like us to eventually have more people officially or unofficially representing:</p>\n<ul>\n<li>the EU, Africa, North America, Asia etc.</li>\n<li>at least one person from an Arabic (sorry for using the broad term) or in general a RTL-written  language</li>\n<li>from less financially stable/fortunate countries/groups (I think the preferred term is \"developing countries\"?)</li>\n<li>from various age groups (i.e. at least one of \"millennial\" and a senior citizen)</li>\n<li>at least one person representing people with special abilities or disabilities</li>\n</ul>\n<p>These people can elect to come forward or be nominated by others for members of the PMC, or simply remain active members in the community, and still feel welcomed and that their voice is heard and opinions are respected. ...all that of course with an eye towards the future of Backdrop as a community and a project.</p>",
        "id": 226746656,
        "sender_full_name": "klonos",
        "timestamp": 1613606373
    },
    {
        "content": "<p>Being as much diverse as possible is only good, however let's not forget that for any software project to succeed the real code contributors are top priority. Maybe I'll sound politically incorrect, but being outspoken person I can't help saying that putting a person over their (coders) heads just because s/he represents certain groups won't help much and could potentially do harm. When looking at anyone who is leading Backdrop project I am not really interested in their gender, race, religion or regional preferences or belongings. What I'd like to see is diverse people but who are really contributing and breathing Backdrop.</p>",
        "id": 226748158,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613607219
    },
    {
        "content": "<blockquote>\n<p>...the real code contributors are top priority.</p>\n</blockquote>\n<p>I disagree. That sort of mentality is what drove people away from Drupal. Documentation is equally important, and promoting the project too - code is not top priority in Backdrop. See <a href=\"https://backdropcms.org/philosophy\">https://backdropcms.org/philosophy</a></p>\n<blockquote>\n<p>Backdrop values the needs of the editor and architect over the needs of the developer.</p>\n</blockquote>",
        "id": 226748478,
        "sender_full_name": "klonos",
        "timestamp": 1613607411
    },
    {
        "content": "<p>BTW, I personally was invited to be part of the PMC way before I could actually contribute any code <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> ...I think it was the rate at which I was raising new issues <span aria-label=\"laughter tears\" class=\"emoji emoji-1f602\" role=\"img\" title=\"laughter tears\">:laughter_tears:</span></p>",
        "id": 226749482,
        "sender_full_name": "klonos",
        "timestamp": 1613608134
    },
    {
        "content": "<p>...another titbit: I believe that I was invited to represent the non-coding portion of the community. Since then, I have moved into coding (please don't judge my skills though <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> ) ...and then it was my personal feeling that by inviting people like <span class=\"user-mention\" data-user-id=\"256674\">@Olaf Grabienski</span> or <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span> we were sorta \"passing the baton\" to them ...but then they also started contributing code <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 226749886,
        "sender_full_name": "klonos",
        "timestamp": 1613608437
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226748478\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>...the real code contributors are top priority.</p>\n</blockquote>\n<p>I disagree. That sort of mentality is what drove people away from Drupal. Documentation is equally important, and promoting the project too - code is not top priority in Backdrop. See <a href=\"https://backdropcms.org/philosophy\">https://backdropcms.org/philosophy</a></p>\n<blockquote>\n<p>Backdrop values the needs of the editor and architect over the needs of the developer.</p>\n</blockquote>\n</blockquote>\n<p>I stay corrected: of course, only code without anything else won't do. I understand importance of every aspect of managing the project. However, if you'd like to put someone from Arabic countries in PMC just because s/he from there, you will push potential code contributors away. We are not here to create some kind of social project that cares about under-represented groups, we are here to contribute code to eventually create one of the most successful CMS. Caring about under-represented groups is really noble thing to do, however I really hope the project leaders won't be distracted too far from what our focus should really be.</p>",
        "id": 226750010,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613608518
    },
    {
        "content": "<blockquote>\n<p>...you will push potential code contributors away.</p>\n</blockquote>\n<p>The role of the PMC is not related to code though. Our role is to oversee the overall direction of the Backdrop project, and to make sure that we uphold our values and principles, as stated in <a href=\"https://backdropcms.org/philosophy\">https://backdropcms.org/philosophy</a> ...not sure if coders would be better or worse in that role. Don't you agree <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> ?</p>",
        "id": 226750363,
        "sender_full_name": "klonos",
        "timestamp": 1613608843
    },
    {
        "content": "<p>...I think that what you may be more interested in is the Core Committers group actually.</p>",
        "id": 226750416,
        "sender_full_name": "klonos",
        "timestamp": 1613608902
    },
    {
        "content": "<blockquote>\n<p>Core committers are responsible for the day-to-day business of reviewing and committing code to the core Backdrop repository.</p>\n</blockquote>",
        "id": 226750450,
        "sender_full_name": "klonos",
        "timestamp": 1613608923
    },
    {
        "content": "<blockquote>\n<p>Core committers are trusted with upholding the philosophies of the Backdrop project, but are not entitled to set the direction of the project or make sweeping changes to subsystems or modules. If there is a question about a change conflicting with the philosophies of the project, the issue should be referred to the PMC for guidance and direction.</p>\n</blockquote>",
        "id": 226750491,
        "sender_full_name": "klonos",
        "timestamp": 1613608945
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226750363\">said</a>:</p>\n<blockquote>\n<p>Don't you agree <span class=\"user-mention silent\" data-user-id=\"258960\">Alan Mels</span> ?</p>\n</blockquote>\n<p>I do. I understand that PMC members should not necessarily be coders. However, returning back to two points which <span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> has formulated </p>\n<p>(1) the detailed information on PMC members, especially how they relate to Backdrop project, should be clearly stated, so new comers don't stretch their heads trying to spend additional time to understand how that or another person got into PMC.</p>\n<p>(2) I really don't insist, but I remain believing that the wider community could play some part defining PMC, at least nominating candidates to PMC.</p>",
        "id": 226751178,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613609506
    },
    {
        "content": "<p>Crazy talk: ...if we allowed defining PMC members by vote of community, then Acquia could have all their 500 employees join, and vote for Dries <span aria-label=\"smiling imp\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling imp\">:smiling_imp:</span> ...we all know how that would end <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></p>",
        "id": 226751374,
        "sender_full_name": "klonos",
        "timestamp": 1613609648
    },
    {
        "content": "<p>JK JK</p>",
        "id": 226751387,
        "sender_full_name": "klonos",
        "timestamp": 1613609665
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226750416\">said</a>:</p>\n<blockquote>\n<p>...I think that what you may be more interested in is the Core Committers group actually.</p>\n</blockquote>\n<p>Just in case if anybody thought I'm seeking some role, I have to formally declare here: that not at the present and not at any time in the future I'll be seeking any role in PMC or Core Commiters group. </p>\n<p>I do care for the project, and not only because AltaGrade has lot's of Drupal 7 customers whom we should land to safe and sane platform when D7 EOL comes, but I have already personal sympathy with its design and the community around it. However, despite my love to Backdrop I won't have any more time than just being useful with anything I can as a regular contributor. </p>\n<p>My agenda here is not about my personal interests, but to straighten up Backdrop procedures and practices if there is a room for improvement in the best interests of the community. I don't like closed groups of whatever nice persons they consists of.</p>",
        "id": 226751598,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613609839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226751374\">said</a>:</p>\n<blockquote>\n<p>Crazy talk: ...if we allowed defining PMC members by vote of community, then Acquia could have all their 500 employees join, and vote for Dries <span aria-label=\"smiling imp\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling imp\">:smiling_imp:</span> ...we all know how that would end :P</p>\n</blockquote>\n<p>I agree. General vote (simple majority) would only harm, however being able to nominate, discuss or have some kind of effect won't. </p>\n<p>As a separate subject matter, I believe Backdrop community needs to develop a new consensus-based voting system that would define stakeholders and count votes according to their owner's \"weights\" in the community (code contributions, working on documentations, marketing field, etc). I would love if every useful person could have express his/her stance when taking decisions.</p>",
        "id": 226752026,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613610194
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> wrong choice of words. What I meant by \"you may be more interested\" was that you seem to be referring to code-related decisions/tasks, which are the role of the Core Committers. The way Core Committers are chosen (which should also be clearly defined) is and should be based on their proven coding skills (+ their dedication to the Backdrop community of course). I hope it's clear what I meant now.</p>",
        "id": 226752193,
        "sender_full_name": "klonos",
        "timestamp": 1613610345
    },
    {
        "content": "<blockquote>\n<p>...however being able to nominate, discuss or have some kind of effect won't.</p>\n</blockquote>\n<p>Agreed <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 226752306,
        "sender_full_name": "klonos",
        "timestamp": 1613610432
    },
    {
        "content": "<p>Having an official and measurable community \"weight\" would hurt contributions I think. As a new contributor, I'd be intimidated to contribute and/or express opinions, if I knew that they would be judged based on my small \"weight\", rather than the validity of my opinion and the arguments I present.</p>",
        "id": 226752536,
        "sender_full_name": "klonos",
        "timestamp": 1613610615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> It is, thanks for clarification. Still wanted to clear the air by noting I'm not raising these issues for my own interests.</p>\n<p>I understand that lot's of things I said above maybe more applicable to Core Committers rather than PMC. But still PMC should also be transparent and the community members should be confident persons with strong (technical and non-technical, but still strong) affiliation to the project are sitting in PMC. If they belong to under-represented groups then its only good, but that nuance should not be defining when electing people to PMC. Again we are not a social experiment, but a software project.</p>",
        "id": 226752595,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613610676
    },
    {
        "content": "<p>But we are also a community of people. Right?</p>",
        "id": 226752678,
        "sender_full_name": "klonos",
        "timestamp": 1613610725
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226752536\">said</a>:</p>\n<blockquote>\n<p>Having an official and measurable community \"weight\" would hurt contributions I think. As a new contributor, I'd be intimidated to contribute and/or express opinions, if I knew that they would be judged based on my small \"weight\", rather than the validity of my opinion and the arguments I present.</p>\n</blockquote>\n<p>I see what you mean and need time to think over this. However, at the moment I feel \"weight\" voting could play positive effect in stimulating more contributions to core.</p>\n<p>Expressing opinions should not be anyhow restricted or punished. However people should understand that in order to get your vote into decision-taking, you should already have brought some kind of use to the project. I think these are two different things.</p>",
        "id": 226752740,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613610783
    },
    {
        "content": "<p>...having only a narrow/specific group or \"spectrum\" of people as leaders a) may pass the wrong idea b) may result in decisions being made without really taking into account the needs of any underrepresented group (not saying that this result will be intentional - just out of not being aware of things first-hand).</p>",
        "id": 226752850,
        "sender_full_name": "klonos",
        "timestamp": 1613610867
    },
    {
        "content": "<p>BTW <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> thank you for bringing these matters up. They would make a really great topic for discussion during the Backdrop Live event. (cc <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span>  and <span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span> )</p>",
        "id": 226752988,
        "sender_full_name": "klonos",
        "timestamp": 1613610970
    },
    {
        "content": "<p>...and I agree that any member of the community should have an easy and clearly-defined way to nominate people for the PMC or the Core Committer group, question PMC decisions in a healthy, respective, and constructive manner, and bring any matter to our attention while feeling absolutely safe to do so.</p>",
        "id": 226753143,
        "sender_full_name": "klonos",
        "timestamp": 1613611120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256729\">klonos</span> <a href=\"#narrow/stream/218635-Backdrop/topic/PMC.20members/near/226752850\">said</a>:</p>\n<blockquote>\n<p>...having only a narrow/specific group or \"spectrum\" of people as leaders a) may pass the wrong idea b) may result in decisions being made without really taking into account the needs of any underrepresented group (not saying that this result will be intentional - just out of not being aware of things first-hand).</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> I should say it's really good that people with your more human-oriented agenda balance out such straightforward business-approach persons like myself. </p>\n<p>You see, I want Backdrop succeed and take rightfully deserved market share from Drupal and WordPress. And that IMO is possible only if/when we have really competitive product at our hands. And that we can have sooner rather then later only if we set priorities right. </p>\n<p>The code must remain our top priority at all times, in my believe. People will evaluate Backdrop project by its usefulness and how it meets their own needs, they won't judge the project whether all spectrum of people are residing on the projects PMC. I am not against under-represented groups and their presence in the community and leading bodies like PMC, however only if they have strong affiliation to Backdrop. So in other words, anyone's affiliation and ties to project is more important, then anything else.</p>",
        "id": 226754024,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613611912
    },
    {
        "content": "<p><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\">https://github.com/backdrop-ops/backdropcms.org/issues/768</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\" title=\"Add more information about PMC members 路 Issue #768 路 backdrop-ops/backdropcms.org\">Add more information about PMC members 路 Issue #768 路 backdrop-ops/backdropcms.org</a></div><div class=\"message_embed_description\">As discussed in Zulip recently, there&#39;s a desire to see more information about PMC members on the Leadership page: @alanmels: it&#39;s easy to recognize those PMC members who use their real nam...</div></div></div>",
        "id": 226754411,
        "sender_full_name": "BWPanda",
        "timestamp": 1613612290
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> ++ ...you beat me to it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 226754470,
        "sender_full_name": "klonos",
        "timestamp": 1613612347
    },
    {
        "content": "<p><strong>bwpanda</strong> leveled up! (Karma: 32)</p>",
        "id": 226754471,
        "sender_full_name": "Dragonbot",
        "timestamp": 1613612347
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256729\">@klonos</span> NP. Feel free to update it if/as necessary.</p>",
        "id": 226754494,
        "sender_full_name": "BWPanda",
        "timestamp": 1613612371
    },
    {
        "content": "<p>This is an excellent discussion by the way. Would contribute but at a dinner party and phone to cumbersome for long chats. Good points all sides.</p>",
        "id": 226755086,
        "sender_full_name": "docwilmot",
        "timestamp": 1613612938
    },
    {
        "content": "<p>Enjoy the dinner party <span class=\"user-mention\" data-user-id=\"256757\">@docwilmot</span> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 226755119,
        "sender_full_name": "klonos",
        "timestamp": 1613612968
    },
    {
        "content": "<blockquote>\n<p>This is an excellent discussion...</p>\n</blockquote>\n<p>Indeed!</p>\n<p>Usually my focus is on code, not so much on discussion, but inspired by this thread, I'd like to share some thoughts.</p>\n<p>I always liked the philosophy behind PMC - as far as I was able to understand / interpret - a committee of people (not necessarily coders) to keep an eye on the big picture. To my understanding diversity in PMC is beneficial, if not required. Let's not underestimate the danger of \"information bubbles\". Only listening to people with the same background will - at some point - lead to wrong decisions, based on wrong assumptions.</p>\n<p>I never thought about the process of nominating someone to the PMC. Mainly because I know, that it can be hard to find people, who dedicate themselves to a project for a longer time and sacrifice (potentially) lots of their spare time. My approach with communities (I'm member of other ones) is: If they're willing to <em>do</em> something, don't hold them back.</p>\n<p>I do not feel like the existence of the PMC reduces (or neglects) the importance of code in any way. The product \"Backdrop CMS\" is code, but code alone without a strong and lively community behind it, wouldn't be sustainable either. In my opinion one of the major strengths of Backdrop is its welcoming culture.</p>",
        "id": 226773121,
        "sender_full_name": "indigoxela",
        "timestamp": 1613632850
    },
    {
        "content": "<p>Thanks for all these opinions. The discussion has been a bit overwhelming (a lot of posts quickly) and hard for me to process. I am happy to talk about all these issues. Because these are complex issues, I like to talk about them during meetings or Backdrop LIVE, writing answers to these questions take a lot of effort. </p>\n<p>Here are my quick thoughts for now. </p>\n<p>1) I appreciate the desire for and need for additional transparency and information about the PMC. We're doing our best, I think, but we can and should do better and I appreciate the questions and discussion. </p>\n<p>2) It is important to for folks who are not aware, that part of the reason that they don't know much about the PMC is that the PMC has not been that active of late. For the most part our community is making decisions for code and community during public meetings and in the issue queue. As a community, I think we are very transparent in our decision making. The lack of information about what the PMC is doing is largely the result of the PMC not doing much. </p>\n<p>This is not necessarily a good thing. It is something worth talking about. </p>\n<p>3) I feel pretty strongly that Backdrop is more than just a software product. We are also very much a community and our work should reflect the values of our community. That's my opinion and I think it is shared by most of the folks who are very active in the community. See: <a href=\"https://backdropcms.org/philosophy\">https://backdropcms.org/philosophy</a></p>\n<p>4)  I agree that there may be a more active role that the community can play in shaping the PMC. However, I don't think that voting for members of the PMC is the right solution. It may through nominating members or it may be through periodic public discussions about the work and makeup of the PMC. This is an interesting discussion to have.</p>",
        "id": 226774269,
        "sender_full_name": "StPaulTim",
        "timestamp": 1613633944
    },
    {
        "content": "<blockquote>\n<p>I like to talk about them during meetings or Backdrop LIVE, writing answers to these questions take a lot of effort. </p>\n</blockquote>\n<p>I appreciate your efforts to answer here in Zulip <span class=\"user-mention\" data-user-id=\"256570\">@StPaulTim</span>, since discussions in live meetings are generally between a much smaller (and often set) group of people.</p>",
        "id": 226774919,
        "sender_full_name": "BWPanda",
        "timestamp": 1613634502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256607\">@BWPanda</span> I realize that. As much as I prefer to talk during live meetings, this does not work for many members of the community. So we need to have these discussions in both places.</p>",
        "id": 226774997,
        "sender_full_name": "StPaulTim",
        "timestamp": 1613634592
    },
    {
        "content": "<p>I feel like what <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span> is trying to figure out, isn't so much who or what the PMCs are, but rather what they are doing to lead the community. People look to leadership to get things done and find direction. Without that direction and vote of confidence to move one way or another, people sit on their hands, work on their own projects or move on to more interesting things.</p>\n<p>Ultimately, Backdrop needs an archetype, a person who is willing to stand up and say: \"here is the direction we are going.\" Someone people can look upto, admire, and be willing to follow. That archetype could be the PMC, it could be a single person. From my observations over the last 6 months, the current active archetype is <span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span>. She is viewed as a person of reason, respected, respectful and a person people are willing to take direction from. The silent archetype is <span class=\"user-mention\" data-user-id=\"258586\">@quicksketch</span>. When he speaks, people listen. What he says, goes. Both are excellent people for those roles and I would personally love to see them step up and be a little louder.</p>\n<p>Many of us want to be passionate and are passionate about Backdrop, but at the same time, completely confused about what there is to be passionate about. Lots of us want Backdrop to succeed. But without the clear path of where it's going and why, it's hard to see any vision of its future.</p>",
        "id": 226782735,
        "sender_full_name": "Phil Ward",
        "timestamp": 1613639683
    },
    {
        "content": "<p>I'm glad I'm not the only one who sees Nate and Jen as 'archetypes' in the Backdrop community. However, unlike <span class=\"user-mention\" data-user-id=\"330989\">@Phil Ward</span>, I don't see this as being a necessarily good thing... For example, when an idea is proposed in the issue queue, and there's lots of positive feedback from various community members, but then Nate or Jen give their feedback which might be in opposition to the majority, I feel like their opinions seem to carry more weight than others, and ideas have been shut down in the past because of that. Now those past examples may well have been not-so-good ideas after all, but my point is that when someone is seen as an 'archetype', their opinion shouldn't  necessarily matter more (carry more weight) than others, especially when they're in the minority...</p>",
        "id": 226785794,
        "sender_full_name": "BWPanda",
        "timestamp": 1613641462
    },
    {
        "content": "<blockquote>\n<p>...Someone people can look upto, admire, and be willing to follow...</p>\n</blockquote>\n<p>I'm not sure if <span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span> or <span class=\"user-mention\" data-user-id=\"258586\">@quicksketch</span> are really comfortable with that. Anyway, I think it should be noted that Nate isn't a member of the PMC.</p>\n<blockquote>\n<p>...my point is that when someone is seen as an 'archetype', their opinion shouldn't necessarily matter more (carry more weight) than others...</p>\n</blockquote>\n<p>Maybe they don't want that, anyway? The \"weight\" or \"loudness\" of a voice within a community can be difficult to handle - for the person speaking, as well as for the person listening. The bigger the weight, the more cautious a statement must be to not \"roll over\" other people's opinions. That can be challenging.</p>\n<p>However, I don't feel like that's a real problem in the Backdrop community. My impression is, that both, the PMC and the Core Committers do a pretty good job (keep in mind: nobody's perfect, we're all just humans <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> ).</p>",
        "id": 226794468,
        "sender_full_name": "indigoxela",
        "timestamp": 1613646231
    },
    {
        "content": "<blockquote>\n<p>we're all just humans</p>\n</blockquote>\n<p>we need to be more careful with this: perhaps we already have members of a non-human minority.</p>",
        "id": 226797361,
        "sender_full_name": "findlabnet(Vladimir)",
        "timestamp": 1613648073
    },
    {
        "content": "<p>Damn it ...humans are onto me <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> <span aria-label=\"robot\" class=\"emoji emoji-1f916\" role=\"img\" title=\"robot\">:robot:</span></p>",
        "id": 226800553,
        "sender_full_name": "klonos",
        "timestamp": 1613650065
    },
    {
        "content": "<blockquote>\n<p>Crazy talk: ...if we allowed defining PMC members by vote of community, then Acquia could have all their 500 employees join, and vote for Dries <span aria-label=\"smiling imp\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling imp\">:smiling_imp:</span> ...we all know how that would end :P</p>\n</blockquote>\n<p>I know of a real world case where an environmental group got taken over by a motorbike group this way. The members joined en masse and outvoted the existing core.</p>",
        "id": 226867963,
        "sender_full_name": "Herb",
        "timestamp": 1613677207
    },
    {
        "content": "<p>Interesting discussion.  I decided to dabble in Backdrop after finally giving up on Drupal 8/9.  I came across a problem and came up with a fix but didn't know how to contribute it.  I joined here, reached out, and was welcomed by helpful and rapid assistance on a Friday night (UK time).  I often found on Drupal a kind of condescending air against anyone who didn't know how to spin up docker/vagrant/puppet/ansible etc but not here; I find the community being welcome and supportive to less expert members.  I've watched a couple of meeting videos and the thing that strikes me is the respectfulness of discussion.  Diversity is good, not for its own sake, but for the ability to make decisions that will benefit a wide audience.  I'd like to see the ethos preserved and don't feel there's a need to have wider elections; I feel that when people are competing to be elected, you lose some of the mutual respect.</p>",
        "id": 226870833,
        "sender_full_name": "yorkshirepudding",
        "timestamp": 1613678388
    },
    {
        "content": "<p>just poking my head back in after a year of pandemic distractions; hope to start participating in things again. <br>\nthis is an interesting discussion. I've got a lot of thoughts on it all. Will try to write it up. I don't think that making the PMC an elected body is good at this point for all the reasons others have stated. I'm part of a community center (that is viewed as an anarchist organization) and our Board is not voted on by the entirety of the collectives in the org. Diversity is a key reason, it also keeps board issues from becoming larger political fights, allows the board to focus on the important work that no one else wants to do so the others can do their thing. it works well. <br>\nand on the specific of Jack, their presence on the PMC speaks very loudly to the community of non profit dev folks that I exist in. It was a clear message that Backdrop intended to make rhetoric of inclusion a fact; that there is more to value in a community than git commits. <br>\nmore later. <br>\nnice to be back and see things moving along nicely.</p>",
        "id": 226872185,
        "sender_full_name": "ericfg",
        "timestamp": 1613678929
    },
    {
        "content": "<p>Thanks for the new inputs since yesterday night (for my time zone). All is really good as we have at least one practical outcome from this discussion <a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\">https://github.com/backdrop-ops/backdropcms.org/issues/768</a> If it also caused anyone some new perspective to ponder, then it's only beneficial to further growth of community.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\" style=\"background-image: url(https://avatars.githubusercontent.com/u/8452564?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop-ops/backdropcms.org/issues/768\" title=\"Add more information about PMC members 路 Issue #768 路 backdrop-ops/backdropcms.org\">Add more information about PMC members 路 Issue #768 路 backdrop-ops/backdropcms.org</a></div><div class=\"message_embed_description\">As discussed in Zulip recently, there&#39;s a desire to see more information about PMC members on the Leadership page: @alanmels: it&#39;s easy to recognize those PMC members who use their real nam...</div></div></div>",
        "id": 226873009,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613679264
    },
    {
        "content": "<p>I'd also like to thank <span class=\"user-mention\" data-user-id=\"258960\">@Alan Mels</span>  for starting this conversation, and everyone else for all the insightful perspectives :) I am concerned about the PMC appearing to be an insider's club. It doesn't feel that way in practice -- perhaps because we don't actually do very much -- but I think impressions are perhaps more important in this case.</p>\n<p>We had talked about providing a nomination form where members of the larger Backdrop community could recommend people (themselves, or others) as potential PMC members. I didn't see this mentioned in the conversation above yet, so I thought it might be worth bringing up. I'm also against voting (for reasons already stated) but I would like to find a way to involve more of the community.</p>",
        "id": 226913733,
        "sender_full_name": "jenlampton",
        "timestamp": 1613702707
    },
    {
        "content": "<p>People have said they like the idea that the PMC is diverse. So in an effort to promote <em>more</em> diversity in the PMC, what do people think of setting a maximum time for PMC members to serve? My reasoning for this suggestion is that without this, the same group of PMC members (or the same core subset of PMC members) will just continue to serve year after year. If we were, however, to set a maximum service time for PMC members, then as old ones rotate out, new ones can be brought in. I believe this will keep the PMC 'fresh' and diverse; getting ideas, leadership and insight from a wider range of people over time, rather than the same each year.</p>",
        "id": 226914126,
        "sender_full_name": "BWPanda",
        "timestamp": 1613703108
    },
    {
        "content": "<p>This would also help to prevent burnout for existing PMC members, something I've seen happen in other community groups/boards.</p>",
        "id": 226914205,
        "sender_full_name": "BWPanda",
        "timestamp": 1613703182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263951\">@jenlampton</span> Thank you for your input. I hope the common sense and community's collective wisdom will derive only useful things from this kind of conversations.</p>",
        "id": 226921801,
        "sender_full_name": "Alan Mels",
        "timestamp": 1613711948
    },
    {
        "content": "<blockquote>\n<p>what do people think of setting a maximum time for PMC members to serve?</p>\n</blockquote>\n<p>This looks like an interesting idea, but I'm not sure if it's feasible in practice. Can we guarantee, that there will always enough members in the PMC, so they can do their job properly?<br>\nAlso, that might bring unnecessary turbulence to the team - they'd probably have to rearrange their team workflow every time a member changes... That could be beneficial, but could also do harm - I'm not sure.</p>\n<blockquote>\n<p>This would also help to prevent burnout for existing PMC members</p>\n</blockquote>\n<p>Yes, burnout can be a severe problem, especially with strongly engaged people, but could a time limit really prevent that?</p>",
        "id": 226928253,
        "sender_full_name": "indigoxela",
        "timestamp": 1613719587
    },
    {
        "content": "<p>the org I mentioned earlier that I'm on the Board of recently adopted a term limit, a big part of it was to give folks a way to step out, especially the most dedicated and prone to burnout<br>\n. we made it so that after X years a board member has to leave for a minimum of 1 year, so they can participate in the overall project or step away entirely. After that they can be re-elected to the board for another full term.</p>",
        "id": 227034339,
        "sender_full_name": "ericfg",
        "timestamp": 1613771800
    }
]