[
    {
        "content": "<p>Another survey:</p>\n<p>How many of you still struggle with databases without utf8-mb4 support? Do most of your sites have support, or are you still bound to hosting, where it's not available?</p>\n<p>This question popped up in a core issue, which lead to a contrib module. But one of the open questions in the core issue is: how many users may be affected? Is the 80% rule applicable in any way?</p>\n<p><a href=\"https://github.com/backdrop/backdrop-issues/issues/4927\">https://github.com/backdrop/backdrop-issues/issues/4927</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/backdrop/backdrop-issues/issues/4927\" style=\"background-image: url(https://avatars.githubusercontent.com/u/5283039?s=400&amp;v=4)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/backdrop/backdrop-issues/issues/4927\" title=\"EntityStorageException when trying to save emojis without UTF8-mb4 enabled in the database 路 Issue #4927 路 backdrop/backdrop-issues\">EntityStorageException when trying to save emojis without UTF8-mb4 enabled in the database 路 Issue #4927 路 backdrop/backdrop-issues</a></div><div class=\"message_embed_description\">I got his error when saving a page: EntityStorageException: SQLSTATE[22007]: Invalid datetime format: 1366 Incorrect string value: &#39;\\xF0\\x9F\\x91\\x8B&lt;/...&#39; for column `backdrop`.`field_da...</div></div></div>",
        "id": 224871921,
        "sender_full_name": "indigoxela",
        "timestamp": 1612273306
    },
    {
        "content": "<p>I have Debian \"old-stable\" on some servers. Therefore, when loading a brand new database, it will need some cosmetics. But this is not a huge problem for me now.</p>",
        "id": 224878101,
        "sender_full_name": "findlabnet(Vladimir)",
        "timestamp": 1612276202
    },
    {
        "content": "<p>Most of my sites have support for utf8-mb4.</p>",
        "id": 224886580,
        "sender_full_name": "Laryn",
        "timestamp": 1612279774
    },
    {
        "content": "<blockquote>\n<p>Most of my sites have support for utf8-mb4.</p>\n</blockquote>\n<p>Interesting, how do you handle the other ones? Did you instruct the users to <em>not</em> insert emojis?</p>",
        "id": 224888517,
        "sender_full_name": "indigoxela",
        "timestamp": 1612280569
    },
    {
        "content": "<p>It's not a Backdrop site, but I maintain a site that does not have support for utf8-mb4 (due to its DB size, it was not converted, as it would take the site offline for hours). For that one, I have custom code that strips any emojis from the content when it's submitted.</p>",
        "id": 224892234,
        "sender_full_name": "oadaeh (Jason Flatt)",
        "timestamp": 1612281908
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256738\">@indigoxela</span> would your custom module pick up all text entry fields on a site?</p>",
        "id": 224892610,
        "sender_full_name": "docwilmot",
        "timestamp": 1612282068
    },
    {
        "content": "<blockquote>\n<p>Interesting, how do you handle the other ones? Did you instruct the users to not insert emojis?</p>\n</blockquote>\n<p>The one that comes to mind that does not have it is on their own (shared) server. At one point I indicated we could update things to allow emojis and they said they had no plans to use emojis and preferred to leave it as is. <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 224893562,
        "sender_full_name": "Laryn",
        "timestamp": 1612282429
    },
    {
        "content": "<blockquote>\n<p>would your custom module pick up all text entry fields on a site?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"256757\">@docwilmot</span>  I suppose so, yes. it handles form item type textfield and texarea, so the module also protects webforms.</p>",
        "id": 224893984,
        "sender_full_name": "indigoxela",
        "timestamp": 1612282571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256573\">@Laryn</span> Yes, that also can happen - people simply do not use emojis, so no Exceptions.</p>",
        "id": 224894163,
        "sender_full_name": "indigoxela",
        "timestamp": 1612282644
    },
    {
        "content": "<p>All mine are on the same VPS and so have support.</p>",
        "id": 224898940,
        "sender_full_name": "BWPanda",
        "timestamp": 1612284450
    },
    {
        "content": "<p>So thinking through options for my benefit; we could validate all text input; but that may be overkill since some text entry doesnt hit the database, like stuff stored in config, and would be fine, emojis or not.<br>\nor we could try/catch the exception only on attempting to save to the database.<br>\nAm I getting it right?</p>",
        "id": 224900743,
        "sender_full_name": "docwilmot",
        "timestamp": 1612285121
    },
    {
        "content": "<p>Fun facts:</p>\n<ul>\n<li>\n<p>in <a href=\"https://www.drupal.org/project/drupal/issues/2681073\">https://www.drupal.org/project/drupal/issues/2681073</a> a user trying to contribute to the Drupal issue, mentioned:</p>\n<blockquote>\n<p>I tried to put an example emoticon into this comment, but it caused the error on <a href=\"http://drupal.org\">drupal.org</a>.</p>\n</blockquote>\n</li>\n<li>\n<p><a href=\"https://www.drupal.org/project/webform/issues/2375541\">https://www.drupal.org/project/webform/issues/2375541</a></p>\n<blockquote>\n<p>This is not limited to just weforms. Try putting an emoji into a node title or body and see if you get an error. I did.</p>\n</blockquote>\n</li>\n<li>\n<p><a href=\"https://www.drupal.org/project/drupal/issues/2002100\">https://www.drupal.org/project/drupal/issues/2002100</a></p>\n<blockquote>\n<p>Just saying, the same error can be triggered by a site search. Pick your favorite popular D7 site and open \"/search/site/%F0%9F%98%89\". ...I found exactly one popular site with this problem. It was the first one I tested, so I thought it would be more common.</p>\n</blockquote>\n</li>\n</ul>",
        "id": 224904404,
        "sender_full_name": "klonos",
        "timestamp": 1612286351
    },
    {
        "content": "<blockquote>\n<p>we could validate all text input; but that may be overkill since some text entry doesnt hit the database, like stuff stored in config, and would be fine, emojis or not.</p>\n</blockquote>\n<p>Overkill or not - the validation has to be generic to catch all possible use-cases. Textfield and textarea are used all over the place and there's no reliable way to distinguish, which ones hit the database and which don't. An allowlist could be a possible enhancement.</p>\n<blockquote>\n<p>or we could try/catch the exception only on attempting to save to the database.</p>\n</blockquote>\n<p>As already mentioned in the related core issue: IMO that would require a bigger change in the database abstraction layer - I wouldn't recommend that. Especially as we don't have any metrics, how many percent of sites are actually affected.</p>",
        "id": 224981119,
        "sender_full_name": "indigoxela",
        "timestamp": 1612336345
    },
    {
        "content": "<p>For completeness: The default search (node/user) is not affected in B nor D7. Open /search/node/%20%20Blah - no Exceptions, even if \"Log all searches\" is turned on. That's because the watchdog \"variables\" column is of type longblob (not text).</p>",
        "id": 224992366,
        "sender_full_name": "indigoxela",
        "timestamp": 1612345037
    },
    {
        "content": "<p>Was just ruminating on options really. But why would this require fiddling with the DB abstraction layer? Could we check entity fields at the level of the entity controller class before saving?</p>",
        "id": 225021706,
        "sender_full_name": "docwilmot",
        "timestamp": 1612362196
    },
    {
        "content": "<blockquote>\n<p>Could we check entity fields at the level of the entity controller class before saving?</p>\n</blockquote>\n<p>On a per entity-form basis, this will never be generic enough IMO. Textfield and textarea are used so many times for so many different forms...</p>",
        "id": 225022255,
        "sender_full_name": "indigoxela",
        "timestamp": 1612362445
    },
    {
        "content": "<p>For core though, the majority of DB saves where emoji saving would be attempted would be via an entity save, no? Cant think of any other non-entity input field where an emoji would be valid entry (there likely would be other fields, just cant think of any now). In which case all of them would eventually call <code>EntityDatabaseStorageController::save()</code>. Could we check the entity's fields in there before we save it? Spitballing...</p>",
        "id": 225024572,
        "sender_full_name": "docwilmot",
        "timestamp": 1612363473
    },
    {
        "content": "<p>Although I'm not (yet) convinced of your finding (core does mostly entity), I'm interested. Wouldn't it make sense to post your \"spitballing\" in the issue thread? <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> BTW, wouldn't that mean that all contrib modules have to solve it separately? Think of webforms...</p>\n<p>Yet unanswered is the question: \"is the problem still relevant enough to take care of it in core?\". So maybe before the decision \"where in core?\" there actually needs to be a decision \"in core or in contrib?\". The survey comments so far make me think \"contrib\". None of the posts here indicate a big problem. I'm not sure, though, if this represents the average Backdrop user, or rather the advanced user.</p>",
        "id": 225025956,
        "sender_full_name": "indigoxela",
        "timestamp": 1612364074
    },
    {
        "content": "<p>reasonable</p>",
        "id": 225031592,
        "sender_full_name": "docwilmot",
        "timestamp": 1612366262
    }
]