[
    {
        "content": "<p>Guys, the spanish community needs some forum space and wiki space to start contributing support and documentation. Would you support us or should we build and host our own website?</p>",
        "id": 210907619,
        "sender_full_name": "develCuy",
        "timestamp": 1600797238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"343076\">@develCuy</span> - So, will there be a Backdrop User Group in Spanish?</p>",
        "id": 210908557,
        "sender_full_name": "StPaulTim",
        "timestamp": 1600797638
    },
    {
        "content": "<p>Do we need an area in the forum for people to post questions in Spanish? <br>\nMy concern about this would be to make sure that we have people willing to answer in Spanish before we set this up.</p>",
        "id": 210908642,
        "sender_full_name": "StPaulTim",
        "timestamp": 1600797677
    },
    {
        "content": "<p>Since we are a community, we have both new and experienced users, we only need a place to record evidence that will serve as reference for future issues and for improving the documentation itself</p>",
        "id": 210910408,
        "sender_full_name": "develCuy",
        "timestamp": 1600798414
    },
    {
        "content": "<p>Has there been any talk of making <a href=\"http://b.org\">b.org</a> multilingual? That could end up being quite a few languages. Or let other groups set up similar sites in own language?</p>",
        "id": 210954229,
        "sender_full_name": "Herb",
        "timestamp": 1600829053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256705\">@Herb</span> - Great question. I was disappointed that we didn't have a discussion on multilingual at Backdrop LIVE, because I'm completely unfamiliar with what we have for multilingual in Backdrop and hence have no idea how difficult it would be to make <a href=\"http://Backdropcms.org\">Backdropcms.org</a> into a multilingual site.</p>",
        "id": 210954362,
        "sender_full_name": "StPaulTim",
        "timestamp": 1600829223
    },
    {
        "content": "<p>The German speaking community does parts of this on a custom website: <a href=\"https://backdrop-cms.de/blog\">https://backdrop-cms.de/blog</a> We have no forum yet, but post regularly. So maybe a custom website could be a quicker solution for the Spanish community, too?</p>",
        "id": 210965220,
        "sender_full_name": "indigoxela",
        "timestamp": 1600844550
    }
]